{"Date Made Public": "2011-12-25", "date": "2011-12-25", "Company": "Stratfor.com, Strategic Forecasting Inc.", "City": "Austin", "State": "Texas", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 68063, "Description of incident": "Anonymous/#AntiSec has claimed responsibility for the hack of a global intelligence company named Stratfor.  Hackers were able to obtain tens of thousands of credit card numbers and other personal information from Stratfor.com.  In addition to credit card numbers with security codes, addresses, and names, the hackers obtained 200GB of emails.  The hackers also claim to have used the credit card information to make over $1 million in donations to charities. Hackers later revealed that the information was even easier to use since it had not been encrypted. Stratfor took the website down within an hour after it was hacked and defaced, but sensitive information had already been leaked.UPDATE (1/04/2012): A total of 68,063 unique credit card numbers, 859,311 unique email addresses, 860,160 hashed passwords, 50,569 phone numbers and 50,618 U.S. resident addresses were posted.  Of the 68,063 credit card numbers, about 36,000 were not expired.  UPDATE (2/15/2012): Hackers posing as officials from Stratfor have started emailing infected links to government subscribers whose email addresses were stolen during the breach.UPDATE (2/27/2012): Wikileaks published more than five million emails that were obtained by hackers during the breach. Some of these emails could contain sensitive information that would unmask sources, reveal security information that the intelligence-gathering company had collected, and reveal information about many Fortune 500 companies that subscribe to Stratfor.UPDATE (5/03/2012): Four Irish and British men were charged for their involvement with Anonymous's faction Antisec and the Stratfor breach. These men were also charged with involvement in hacks of Fox, Sony Pictures, and the Arizona Department of Public Safety.UPDATE (7/02/2012): Stratfor agreed to settle a class action lawsuit filed on behalf of customers.  Stratfor will offer members of the class action lawsuit one month of free access to its service, worth $29.08, and an electronic book published by Stratfo called \"The Blue Book,\" priced at $12.99.  These two offers may cost Stratfor $1.75 million.  Additionally, Stratfor agreed to pay for a credit monitoring service for any members of the class action lawsuit who request the service.  Stratfor will also pay a $400,000 lump sum for plaintiff attorneys and various fees.UPDATE (08/11/2012): Emails with data about the implementation of the domestic surveillance program TrapWire were also exposed. TrapWire gathers surveillance data from major cities in the US, encrypts it, and sends it to a secretive central database center.UPDATE (05/28/2013): A member of Anonymous pleaded guilty to playing a part in hacking Stratfor Global Intelligence Service, Arizona Department of Public Safety, the Boston Police Patrolmen's Association, the FBI's Virtual Academy, and the sheriff's office of Jefferson County, Alabama.  His charges are related to stealing emails and credit card data as well as hacking Stratfor and several other websites.  He faces up to 10 years in prison and is scheduled to be sentenced on September 6.UPDATE (11/15/2013): The member of Anonymous was sentenced to 10 years in prison and three years of probation.", "Information Source": "Databreaches.net", "Source URL": "", "Year of Breach": 2011, "Latitude": 30.267153, "Longitude": -97.743061}