{"Date Made Public": "2013-12-06", "date": "2013-12-06", "Company": "Horizon Healthcare Services, Inc. (Horizon Blue Cross Blue Shield)", "City": "Newark", "State": "New Jersey", "Type of breach": "PORT", "Type of organization": "BSF", "Total Records": 840000, "Description of incident": "Sometime between November 1 and 3, two unencrypted laptops were stolen from employee workstations.  The laptops were password-protected and cable-locked to the workstations. Names, Social Security numbers, addresses, dates of birth, Horizon Blue Cross Blue Shield New Jersey identification numbers, and demographic information may have been exposed. Almost 840,000 Horizon Blue Cross Blue Shield members were affected.UPDATE (04/06/2015): A class action lawsuit was filed against Ble Cross Blue Shield of New Jersey of more than 830,000 members arguing that they were at risk of identity theft due to the data breach when stolen lap tops were discovered that contained personal information, including Social Security numbers. The judge in the case dismissed the class action lawsuit claiming that since there was no evidence that the information on the lap tops was used to create harm,  the judge clained there was no standing. More Information: http://www.nj.com/news/index.ssf/2015/04/judge_tosses_data-breach_suit_a...She also \"dismissed a claim of economic injury brought by three of the plaintiffs who argued that their premiums should have provided for the security of their personal information. Citing precendent, Cecchi dismissed that claim as well, writing that the plaintiffs failed to demonstrate actual economic harm as a result of the breach.\"UPDATE (03/1/2017): \"New Jersey Attorney General Christopher S. Porrino announced Feb.17 that Horizon Healthcare Services, Inc., the state's largest health care provider, will pay $1.1 million and improe data security practices after allegations of failing to properly protect the privacy of close to 690,000 New Jersey policyholders.\"More Information: http://legalnewsline.com/stories/511085361-horizon-healthcare-services-s...  ", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2013, "Latitude": 40.735657, "Longitude": -74.172367}