{"Date Made Public": "2006-01-25", "date": "2006-01-25", "Company": "Providence Home Services", "City": "Portland", "State": "Oregon", "Type of breach": "PORT", "Type of organization": "MED", "Total Records": 365000, "Description of incident": "Backup tapes, laptops              and disks containing Social Security numbers, clinical and demographic              information were stolen from the car of an employee. In a small number of cases, patient financial data was              stolen. UPDATE               (9/26/06)             Providence Health System and the Oregon              Attorney General have filed a settlement agreement.  Providence              will provide affected patients with free credit monitoring, offer              credit restoration to patients who are victims of identity fraud,              and reimburse patients for direct losses that result from the data              breach.  The company must also enhance its security programs.              UPDATE  (7/15/08) Providence Health will pay $100,000 and adhere to a compliance plan              under the first ever Resolution Agreement negotiated by              CMS (Centers for Medicare and Medicaid Services of the U.S. Dept.              of Health and Human Services) under the HIPAA Privacy and Security              Standards.              The Corrective              Action Plan requires Providence to revamp its security policies              to include physical protections for portable devices and off-site              transport and storage of backup media. Further, it must implement              technical safeguards, such as encryption and password protection.              And it must conduct random compliance audits and submit compliance              reports to HHS for the next three years.UPDATE (4/16/2012): The Oregon Supreme Court struck down a class-action suit against Providence Health Systems.  The Oregon Supreme Court claimed that there was no evidence that any of the 365,000 patients who were affected by the breach suffered any financial loss or other adverse consequences.", "Information Source": "Dataloss DB", "Source URL": "", "Year of Breach": 2006, "Latitude": 45.523452, "Longitude": -122.676207}