{"Date Made Public": "2014-01-24", "date": "2014-01-24", "Company": "Coca-Cola Company", "City": "Atlanta", "State": "Georgia", "Type of breach": "PORT", "Type of organization": "BSO", "Total Records": 18000, "Description of incident": "The Coca-Cola Company announced the theft of several computers from one of their locations that contained personal information on employees and other individuals. The company did not detail the specific information that was stored on the stolen computers. The theft was discovered on December 19, 2013.UPDATE (11/13/2014): \"A class action lawsuit has been filed against the Coca-Cola company and its regional distribution subsidiaries on behalf of 70,000 people whose information and identities have been allegedly compromised by the theft of 55 laptops from the company's Atlanta headquarters over a six year period.\"The company did not notice the theft of these laptops until November of 2013 prompting the company to send notices to those affected in January 2014. According to the company 18,000 individuals had Social Security numbers affected, and an additional 56,000 individuals that may have had their drivers license information compromised. The laptops were not encrypted and along with the above information, the laptops may have also included names, addresses, ethnicity and other personal information.The class action suit alleges that the company failed to protect personal data, but failed in adequately notifying victims of the breach.More Information: http://pennrecord.com/news/15093-class-action-filed-against-coca-cola-fo...UPDATE (October 13, 2015): A Coca-Cola employee who showed he suffered harm after company laptops were stolen is pursuing a class action lawsuit against the company according to a Pennsylvania federal court. More information: http://www.businessinsurance.com/article/20151013/NEWS06/151019945/penns...", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2014, "Latitude": 33.770933, "Longitude": -84.396644}