{"Date Made Public": "2014-02-28", "date": "2014-02-28", "Company": "80's Tees", "City": "Mt. Pleasant", "State": "Pennsylvania", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 3503, "Description of incident": "80sTees.com, Inc. announced a data breach that was much larger than originally thought. The online retailer originally reported the breach in April of 2013 to customers whose credit card numbers had been used fraudulently. Since that time, the retailer's investigation uncovered that the scope of the exposure to customer credit card information was larger than originally believed. The company has notified any customer who used the site from June 3, 2012 through April 30, 2013 that their credit card may have been used fraudulently.  Originally the company was contacted by Discover Card requesting an investigation due to some unauthorized charges experienced by Discover cards customers. The company completed their own investigation and on February 27, 2013 learned that a small number of Visa customers had also experienced unauthorized charges. On March 6, 2013 Mastercard also contacted the company regarding fraudulent charges against their credit card holders.The company hired a forensic investigator who discovered that the company had been a victim of a cyber attack that gained access to and installed malware on their website server in eary June 2012. Their anitvirus and malware scans did not detect the malware. April 3, 2013 the company notified approximately 3,503 customers of the breach. This is the amount that was reported to the company by the credit card companies.  On April 22, 2013, the company received a report from the forensic investigator that 2,598 credit cards were compromised. On April 30, 2013 the company received calls from two customers stating that their cards had been compromised. The company investigated those customers' complaints and reported the issue to the Secret Service. The Secret Service asked the company to not provide any additional notice until their investigation had been completed.The Secret Service investigation uncovered that the hackers had set up an unauthorized email account that captured the company's credit card transactions without their knowledge. The Secret Service could not definitely say who the hacker or hackers were. Based on the information the company received, they believed it to be a former high level employee who has since died.   ", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2012, "Latitude": 40.185893, "Longitude": -79.562841}