{"Date Made Public": "2009-02-18", "date": "2009-02-18", "Company": "CVS Pharmacies", "City": "Woonsocket", "State": "Rhode Island", "Type of breach": "PHYS", "Type of organization": "MED", "Total Records": 0, "Description of incident": "The CVS Pharmacy chain, the largest              in the country with 6,300 outlets, has agreed to a $2.25 million settlement              with the U.S. Dept. of Health and Human Services. Indianapolis TV              station WTHR engaged in an extensive investigation beginning in 2006              of local CVS Pharmacies and their pharmacies in other cities nationwide              including Boston, Chicago, Cleveland, Detroit, Dallas, Louisville,              Miami, New Haven (Conn.), Philadelphia, Phoenix, and CVS headquarters              in Woonsocket, RI. They found that CVS pharmacies were disposing of              documents, such as labels from prescription bottles and old prescriptions,              in unsecured dumpsters. The HHS's Office of Civil Rights charged that              CVS failed to implement adequate policies and procedures to              reasonably and appropriately safeguard protected health information              during the disposal process failed to adequately train employees              on how to dispose of such information properly and did not maintain              and implement a sanctions policy for members of its workforce who              failed to comply with its disposal policies and procedures.              In a coordinated action, CVS Caremark Corporation, the parent company              of the chain, also signed a consent order with the Federal Trade Commission              to settle potential violations of the FTC Act. UPDATE              (7/16/09): A state board has given final approval              to settlements with Indiana's two largest drugstore chains for leaving              patient information in the trash. CVS has paid a $2.25 million fine              to settle a probe by the U.S. Office of Civil Rights. Also CVS will              donate $1,000 to charity as part of the state settlement.", "Information Source": "Dataloss DB", "Source URL": "", "Year of Breach": 2009, "Latitude": 42.002876, "Longitude": -71.514784}