{"Date Made Public": "2010-04-21", "date": "2010-04-21", "Company": "Massachusetts Eye and Ear Infirmary", "City": "Boston", "State": "Massachusetts", "Type of breach": "PORT", "Type of organization": "MED", "Total Records": 3526, "Description of incident": "On February 19, 2010, a laptop belonging to a physician affiliated with the Massachusetts Eye and Ear Infirmary was stolen while the physician was lecturing in South Korea. The laptop belonged to a neurologist with a particular focus on ringing in the ears, or tinnitus. The following types of information about affected individuals associated with Mass. Eye and Ear may have been present on laptop, names, addresses, telephone numbers, emails, date of birth and age, sex, medical record numbers, dates of service, medical information, including diagnoses, symptoms, test results, and prescriptions, name and contact information for patient pharmacies, and research participant status. In addition, four individuals’ information also included their pharmacy insurance account number.UPDATE (09/17/2012): Massachusetts Eye and Ear Infirmary and Massachusetts Eye and Ear Associates Inc. agreed to pay the U.S. Department of Health and Human Services (HHS) $1.5 million to settle potential violations of the Health Insurance Portability and Accountability Act (HIPAA) Security Rule.  An HHS Office for Civil Rights investigation indicated that Mass. Eye and Ear failed to take necessary steps to comply with certain requirements of the Security Rule.  These steps include conducting a thorough analysis of the risk to the confidentiality of electronic protected health information (ePHI) maintained on portable devices, implementing security measures sufficient to ensure the confidentiality of ePHI that Mass. Ear and Eye created, maintained, and transmitted using portable devices, adopting and implementing policies and procedures to restrict access to ePHI to authorized users of portable devices, and adopting and implementing policies and procedures to address security incident identification, reporting, and response. Mass. Ear and Eye will also have to adhere to a corrective action plan to address these issues. The full HHS disclosure can be read here: http://www.hhs.gov/news/press/2012pres/09/20120917a.html", "Information Source": "Dataloss DB", "Source URL": "", "Year of Breach": 2010, "Latitude": 42.358431, "Longitude": -71.059773}