{"Date Made Public": "2010-05-28", "date": "2010-05-28", "Company": "Aetna", "City": "South Windsor", "State": "Connecticut", "Type of breach": "PHYS", "Type of organization": "BSO", "Total Records": 6372, "Description of incident": "A cabinet full of documents with sensitive information was found sitting on the side of the road. A woman made the discovery about a month ago and gave the documents to investigators with Aetna Insurance Co. The woman said she saw a bureau on the side of the road in front of Admiral Storage in South Windsor with a sign that said \"free.\" She brought it home and discovered the documents. There were eight bags of nothing but Social Security numbers, names, and death benefits. Information also included patient records and medications. Aetna responded by saying, \"Aetna is committed to protecting the privacy of our members and we take this situation seriously. We have policies for properly safeguarding our members’ information, and we are investigating how this incident occurred, but it appears to be human error. The woman contacted us via e-mail on the evening of May 5, and we immediately responded the next morning. She has consistently declined to give us her name or phone number, or to make arrangements to allow us to retrieve the documents at a place convenient for her, or to return them to us. As of today, we now have the files, and will go through each of them to determine the contents and whether any member information has been breached. If it has been, we will notify those members and take steps to mitigate any potential harm.\" The woman attempted to arrange the hand-off, however, a short time after she got off the phone with the company, three men from Aetna showed up at her workplace, unannounced, and asked for the documents immediately. The woman said, \"But when they sent the three guys to my work yesterday, it was an intimidation tactic and I didn't appreciate it. So that told me what I was going to do. That they were going to try and hide it.\" Aetna said someone from the company made a \"serious human error,\" and it will now go through the files to make sure no sensitive information was lost. What's more troubling, the woman said, is that the bureau wasn't the only piece of furniture offered for free that day. \"Out of the pieces that were up for grabs, whose to say that I've got the only piece that was full of Aetna papers.\" The woman has also contacted the state to investigate the situation. Aetna has clients across the country.UPDATE (8/2/10): Aetna notified 7,250 clients of the breach and reported that 6,372 were affected. ", "Information Source": "Dataloss DB", "Source URL": "", "Year of Breach": 2010, "Latitude": 41.832222, "Longitude": -72.569722}