{"Date Made Public": "2010-06-09", "date": "2010-06-09", "Company": "Apple Inc., AT&T", "City": "Cupertino", "State": "California", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 120000, "Description of incident": "A security breach has exposed iPad owner information. Dozens of CEOs, military officials, and top politicians may have been affected. They—and every other buyer of the cellular-enabled tablet—could be vulnerable to spam marketing and malicious hacking. The breach exposed the most exclusive email list on the planet, a collection of early-adopter iPad 3G subscribers that includes thousands of A-listers in finance, politics and media, from New York Times Co. CEO Janet Robinson to Diane Sawyer of ABC News to film mogul Harvey Weinstein to Mayor Michael Bloomberg. It even appears that White House Chief of Staff Rahm Emanuel's information was compromised. It doesn't stop there. According to the data given by the web security group that exploited vulnerabilities on the AT&T network, 114,000 user accounts have been compromised, although it's possible that confidential information about every iPad 3G owner in the U.S. has been exposed.UPDATE (01/18/2011): Chat logs of the accused iPad hackers were turned over to investigators.  It appears that two men used an \"account slurper\" to conduct a \"brute force\" attack that lasted five days and extracted data from iPad users who accessed the Internet through AT&T's 3G network.  Each of the two men were charged with one count of conspiracy to access a computer without authorization and one count of fraud.UPDATE (06/23/2011): One of the people responsible for writing the malicious code used to breach AT&T's computer servers pleaded guilty to his part in the attack.UPDATE (11/20/2012): The second person responsible for discovering and exploiting a security weakness was found guilty.  AT&T iPad subscribers had their emails exposed because of the security issue.UPDATE (03/19/2013): One of the conspirators was sentenced to 41 months in prison for identity theft and conspiracy to gain unauthorized access to computers.", "Information Source": "Dataloss DB", "Source URL": "", "Year of Breach": 2010, "Latitude": 37.322998, "Longitude": -122.032182}