{"Date Made Public": "2012-05-25", "date": "2012-05-25", "Company": "University of Nebraska, Nebraska Student Information System, Nebraska College System", "City": "Lincoln", "State": "Nebraska", "Type of breach": "HACK", "Type of organization": "EDU", "Total Records": 654000, "Description of incident": "A University technical staff member discovered a breach on May 23.  Staff took steps to limit the breach and there was no clear evidence that any information was downloaded.  The Social Security numbers, addresses, grades, transcripts, housing and financial aid information for current and former University of Nebraska students may have been accessed.  The database also included the information of people who applied to the University of Nebraska, but may have not been admitted, and alumni information as far back as Spring of 1985. The University of Nebraska was still investigating the extent of the breach as of May 25, 2012.UPDATE (05/29/2012): The University of Nebraska created a webpage for information about the breach.  Close to 21,000 people had bank account information that was linked to the student information system and exposed.  The University of Nebraska's computer database also held 654,000 Social Security numbers, though it is unclear if that number completely overlaps the number of individuals who had their bank account information exposed.  Current and former students of the University of Nebraska campuses in Lincoln, Omaha, and Kearney were affected; as well as anyone who applied to the University since 1985.UPDATE (06/01/2012): The Nebraska College System began using a shared student information system called NeSIS in 2009.  This resulted in data from Chadron State, Peru State, and Wayne State colleges being exposed.UPDATE (09/10/2012): Police seized computers and related equipment belonging to a University of Nebraska-Lincoln (UNL) undergraduate student who is believed to be involved in the incident.UPDATE (12/11/2012): The former UNL student has been charged with intentionally accessing a protected computer system and causing damage of at least $5,000.UPDATE (06/22/2013): The hacker now faces an additional nine charges of exceeding his authorized access to a computer and two charges of knowingly transmitting a program that damaged computers owned by the University of Nebraska and Nebraska State College Systems.UPDATE (12/03/2013): The hacker and former UNL student pleaded guilty to one count of intentionally damaging a protected computer and causing loss in excess of $5,000.  His sentencing was scheduled for March 21, 2014.", "Information Source": "Dataloss DB", "Source URL": "", "Year of Breach": 2012, "Latitude": 40.806862, "Longitude": -96.681679}