{"Date Made Public": "2013-02-03", "date": "2013-02-03", "Company": "Premier Tax", "City": "Montgomery", "State": "Alabama", "Type of breach": "INSD", "Type of organization": "BSF", "Total Records": 0, "Description of incident": "Six people who worked in tax preparation were charged with fraud and filing false tax returns in March of 2012.  Over 1,000 false tax returns were filed between October 2009 and April 2012.  The fraudulent returns totalled more than $1.7 million.  More Information: https://www.databreaches.net/alabama-woman-pleads-guilty-in-id-theft-and...UPDATE (01/29/2013): Two others were linked to the conspiracy and charged.  One of them was an employee of an unnamed Alabama state agency. She was able to access a state database of personal information and provide it to others in the identity theft ring.UPDATE (3/13/2013): \"Bruce King, the founder and operator of Premier Tax, was  sentenced today in Montgomery, Ala., to 70 months in prison and ordered  to pay $781,305 in restitution to the Internal Revenue Service (IRS) for  orchestrating a tax fraud scheme at his business, the Justice  Department and the IRS announced. King had previously pleaded guilty to  charges of conspiring to defraud the United States and filing false tax  returns.           According to court  documents, Premier Tax was a tax preparation business operated by King  that had several locations in Alabama and Georgia. King held training  sessions in which he taught preparers how to falsify tax returns in  order to fraudulently increase clients’ tax refunds. Those he taught  went on to work at Premier Tax and filed numerous false tax returns.  According to court documents, the tax loss caused by these fraudulent  returns exceeded $1 million. To date, seven return preparers trained by  King have also pleaded guilty and been sentenced.\"More Information: https://www.justice.gov/opa/pr/owner-tax-preparation-business-sentenced-...UPDATE (4/15/2014): \"The United  States has requested that the federal district court in Montgomery,  Ala., permanently bar Tonja Renee Toney and Jenika Williams from  preparing federal income tax returns for others, the Justice Department  announced today.              According to the complaint, which was filed yesterday in the U.S.  District Court for the Middle District of Alabama, Toney and Williams  each prepared tax returns as employees of Premier Tax in Montgomery in  2007 and 2008, and both   pleaded guilty      to charges related to their work at Premier Tax.  The complaint  further alleges that both prepared false and fraudulent tax returns  after being interviewed by Internal Revenue Service (IRS) agents in  connection with their activities at Premier Tax.                The complaint alleges that both defendants have knowingly prepared  federal income tax returns for customers that understated the  customers’ tax liability by reporting false income in order to inflate  the taxpayer’s claim to an Earned Income Tax Credit.\" More Information: https://www.justice.gov/opa/pr/justice-department-sues-shut-down-alabama...", "Information Source": "Government Agency", "Source URL": "", "Year of Breach": 2013, "Latitude": 32.366805, "Longitude": -86.299969}