{"Date Made Public": "2014-07-14", "date": "2014-07-14", "Company": "Goodwill Industries International Inc.", "City": "Rockville", "State": "Maryland", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 868000, "Description of incident": "Financial institutions are tracking what appears to be fraudulent activity at numerous Goodwill retail stores. The fraudulent activity involves credit card breaches and that the compromised credit cards appear to have started at Goodwill stores across the country. The credit card information is then showing up at other retail establishments, similar to the breaches that occurred at Target, Neiman Marcus, P.F. Changs, etc.“Goodwill Industries International was contacted last Friday  afternoon by a payment card industry fraud investigative unit and  federal authorities informing us that select U.S. store locations may  have been the victims of possible theft of payment card numbers,” the  company wrote in an email.  “Investigators are currently reviewing available information,” the  statement continued. “At this point, no breach has been confirmed but an  investigation is underway. Goodwills across the country take the data  of consumers seriously and their community well-being is our number one  concern. Goodwill Industries International is working with industry  contacts and the federal authorities on the investigation. We will  remain appraised of the situation and will work proactively with any  individual local Goodwill involved taking appropriate actions if a data  compromise is uncovered.”Goodwill Industries stated they learned of the potential breach on July 18th and is working with federal investigators to determine if the breach is legitimate and if legitimate. how many stores were affected. UPDATE (9/10/2014): Goodwill Industries announced that the data breach they suffered is linked to a third party vendor.  \"Goodwill said a forensic investigation had found that a third-party  vendor's systems had been attacked by malware, providing the attackers  with access to the credit card data of several of that vendor's  customers intermittently between February 10, 2013 and August 14, 2014\".According to Goodwill, 330 Goodwill stores in 20 states were affected. Forbes reported that 868,000 individuals were affected.More Information: http://www.esecurityplanet.com/network-security/goodwill-data-breach-lin... ", "Information Source": "Krebs On Security", "Source URL": "", "Year of Breach": 2014, "Latitude": 39.083997, "Longitude": -77.152758}