{"Date Made Public": "2015-05-26", "date": "2015-05-26", "Company": "Internal Revenue Service", "City": "Washington", "State": "District Of Columbia", "Type of breach": "UNKN", "Type of organization": "GOV", "Total Records": 700000, "Description of incident": "A previous story that was broken by Brian Krebs, Krebs On Security, regarding fradulent tax returns being filed by identity thieves who gained the information using data directly from the IRS website, was confirmed today by the IRS Commissioner Josh Koskinen.Mr. Koskinen confirmed that the identity thieves pulled data off of the IRS website to file fraudulent tax returns on unsuspecting individuals. The IRS became suspicious due to a large increase of individuals requesting their tax transcripts. The investigation revealed that approximately 200,000 suspicious attempts occurred and 100,000 of those were successful in being authenticated through the IRS website. According to the IRS these atte27/politics/irs-cyber-breachmpts started in February and continued through mid-May 2015 and totaled over $50 million dollars in fraudulent refunds. More Information: http://krebsonsecurity.com/2015/05/irs-crooks-stole-data-on-100k-taxpayers-via-get-transcript-feature/    UPDATE (5/28/2015): The IRS has communicated that the recent breach of 100,000 individuals they believe originated from Russia. The IRS is claiming that this was not a hack, instead that they \"went in the front door of the IRS and unlocked it with the key\". More Information: http://www.cnn.com/2015/05/27/politics/irs-cyber-breach-russia/index.htmlUPDATE (8/17/2015): The IRS is now announcing that the data breach that was first reported in May, is three-times larger than originally reported. After a review of the 2015 filing season, the IRS is sending additional letters to individuals warning them that their information may have been compromised and the possibly threat of potential identity theft. More Information: http://money.cnn.com/2015/08/17/technology/irs-data-theft/index.htmlPrivacy Rights Clearinghouse has changed our original number of  100,000 individuals to 330,000 individuals affected in this breach on Aug.19, 2015 as is being reported in the media. UPDATE (2/26/20116): The hacking incident according to the IRS, has increased to 700,000 individual Social Security numbers being affected.More Information: http://www.cbsnews.com/news/irs-hackers-stolen-taxpayer-information-breach/", "Information Source": "Krebs On Security", "Source URL": "", "Year of Breach": 2015, "Latitude": 38.907192, "Longitude": -77.036871}