{"Date Made Public": "2016-01-27", "date": "2016-01-27", "Company": "Wendy's", "City": "Dublin", "State": "Ohio", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "Wendy's, the fast food chain retailer, is investigating reports regarding a potential breach of their credit card systems in their restaurants. The company has hired a security expert to investigate the incidences. The company received reports from their payment industry contacts alerting them of unusual activity and fraudulent charges after credit/debit cards were used at their locations for legitimate purchases. A spokesperson for the restaurant chained stated, \"We began investigating  immediately, and the period of time we’re looking at the incidents is  late last year,” he said. “We know it’s [affecting] some restaurants but  it’s not appropriate just yet to speculate on anything in terms of  scope.”KrebsOnSecurity heard from banking industry sources stating a possible breach and the reports were coming mostly from financial institutions in the midwest. Krebs has also heard \"similar reports from banks on the east coast\".\"The Wendy’s system includes approximately 6,500 franchise and  company-operated restaurants in the United States and 28 countries and  U.S. territories worldwide. Bertini said most of the U.S.-operated  stores are franchises.\"More information: http://krebsonsecurity.com/2016/01/wendys-probes-reports-of-credit-card-...UPDATE (3/2/2016): The Wendy's credit/debit card breach appears to be much worse then originally thought, according to credit unions. \"This is what we’ve heard from three different credit union CEOs in Ohio now: It’s more concentrated and the amounts hitting compromised debit accounts is much higher that what they were hit with after Home Depot or Target,” Berger said. “It seems to have been been [the work of] a sophisticated group, in terms of the timing and the accounts they targeted. They were targeting and draining debit accounts with lots of money in them.”More information: https://krebsonsecurity.com/2016/03/credit-unions-feeling-pinch-in-wendy...UPDATE (5/12/2016): After an investigation by the fast food chain, less then 5 percent of its restaurants were affected by the data breach. \"Based on preliminary findings of the investigation and other information, the Company believes that malware, installed through the use of compromised third-party vendor credentials, affected one particular point of sale system at fewer than 300 of the approximately 5,500 franchised North America Wendy's restaurants, starting in the fall of 2015.\"More Information: http://www.foxnews.com/tech/2016/05/11/wendys-data-breach-hit-5-percent-...", "Information Source": "Krebs On Security", "Source URL": "", "Year of Breach": 2016, "Latitude": 37.702152, "Longitude": -121.935792}