{"Date Made Public": "2016-06-14", "date": "2016-06-14", "Company": "Acer Service Corporation", "City": "San Jose", "State": "California", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 35000, "Description of incident": "\"We recently identified a security issue involving the information of certain customers who used our ecommerce site between May 12, 2015 and April 28, 2016, which resulted in unauthorized access by a third party.\"The information compromised included names, addresses, card numbers, expiration dates, and three digit security code on the back of cards.More Information: http://oag.ca.gov/ecrime/databreach/reports/sb24-62344UPDATE (2/10/2017): \"On January 26, New York Attorney General Eric Schneiderman announced a settlement with Acer Service Corporation over an alleged data breach involving more than 35,000 credit card numbers, including the credit card information and other personal information of 2,250 New York residents. As part of the settlement, Acer agreed to pay $115,000 in penalties and to improve its data security practices. The penalty amounts to approximately $50.12 per New York resident potentially affected.Acer is a computer manufacturer based in Taiwan. According to the A.G.'s press release, Acer maintained a website that had numerous security vulnerabilities. For example, between July 2015 and April 2016, an Acer employee had enabled a debugging mode on Acer's e-commerce platform, during which time the website saved all information provided by customers in an unencrypted format. The unencrypted information included customers' full names, home addresses, email addresses, credit card numbers, card expiration dates, card verification numbers, user names, and passwords. Additionally, Acer erroneously configured its website to allow directory browsing by unauthorized users. This configuration allowed external viewing of and access to subdirectories on the website using a simple web browser, according to the A.G.\"More information: http://www.mondaq.com/unitedstates/x/567202/Consumer+Law/NY+AG+Settles+w...", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2016, "Latitude": 37.328862, "Longitude": -121.893598}