{"Date Made Public": "2017-04-29", "date": "2017-04-29", "Company": "Larson Studios", "City": "Los Angeles", "State": "California", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"An anonymous hacker has carried through on a threat to release “Orange Is the New Black” season five episodes online — after Netflix allegedly failed to respond to the cybercriminal’s shakedown demands.Variety was unable to verify the authenticity of the “OITNB” episodes the hacker claimed to have shared on popular file-sharing site the Pirate Bay.The first 10 episodes of season 5 were apparently shared shortly before 6 a.m. ET Saturday, with the 10 files comprising a total of 11.46 gigabytes. The hacker, who uses the handle “thedarkoverlord,” published the premiere episode from the upcoming season of “Orange Is the New Black” on Friday to the Pirate Bay.Netflix has set June 9 for the release of season five of “Orange Is the New Black.” It’s possible that the streamer will move up the “OITNB” premiere date now that the bulk of the episodes have leaked.Reps for Netflix did not respond to a request for comment about the latest developmentAccording to “thedarkoverlord,” the hacker or hackers also have obtained unreleased shows from ABC, Fox, National Geographic and IFC. The content appears to have been stolen in an attack on post-production studio Larson Studios in late 2016, according to piracy-news site TorrentFreak. “Thedarkoverlord” explained in an online post that they obtained only the first 10 of the 13 episodes of “OITNB” season 5 because the cyberattack was carried out before the final three installments were available.In a statement Friday, Netflix said: “We are aware of the situation. A production vendor used by several major TV studios had its security compromised and the appropriate law enforcement authorities are involved.”It’s not clear what impact the theft and piracy of one of Netflix’s top shows will have. The hacker (or hacker collective) behind the heist has claimed to have made an extortion demand to the company, asking for an unspecified sum of money. However, the motive for purloining and leaking “OITNB” could be more about bragging rights in the cybercrime underworld.\"", "Information Source": "Maryland Attorney General", "Source URL": "http://www.marylandattorneygeneral.gov/Pages/IdentityTheft/breachnotices.aspx?subfolder=2015", "Year of Breach": 2014, "Latitude": 34.099357, "Longitude": -118.331384}