{"Date Made Public": "2017-05-04", "date": "2017-05-04", "Company": "Sabre Corporation", "City": "Southlake", "State": "Texas", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 32000, "Description of incident": "\"Sabre Corporation disclosed a breach of its hospitality solutions SynXis central-reservations system that may have exposed consumers' payment card data and personally identifiable information.According to an SEC filing made by the company on Tuesday, the $3.37 billion corporation acknowledged that its SynXis software-as-a-service platform was accessed by an unauthorized party, who gained access to payment information corresponding to a subset of hotel reservations. Sabre did not specify when or how the actual intrusion took place or how many records are potentially affected. Sabre does not believe any other system was affected.\"The unauthorized access has been shut off and there is no evidence of continued unauthorized activity. There is no reason to believe that any other Sabre systems beyond SynXis Central Reservations have been affected,\" the company reported in its quarterly filing and a related press statement.Sabre contacted law enforcement, began notifying affected customers and hired the cybersecurity investigatory firm Mandiant to investigate. According to Sabre’s marketing literature, more than 32,000 properties use Sabre’s SynXis reservations system.Sabre told customers that it didn’t have any additional details about the breach to share at this time, so it remains unclear what the exact cause of the breach may be or for how long it may have persisted, reports Krebs on Security. A card involving traveler transactions for even a small percentage of the 32,000 properties that are using Sabre’s impacted technology could jeopardize a significant number of customer credit cards in a short amount of time.\"", "Information Source": "Maryland Attorney General", "Source URL": "http://www.marylandattorneygeneral.gov/Pages/IdentityTheft/breachnotices.aspx?subfolder=2015", "Year of Breach": 2014, "Latitude": 32.941236, "Longitude": -97.134178}