{"Date Made Public": "2017-05-15", "date": "2017-05-15", "Company": "Talx Corporation", "City": "St. Louis", "State": "Missouri", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"Talx Corporation (“TALX”), a wholly owned subsidiary of Equifax Inc., is writing to inform you about a data security incident that may have resulted in the unauthorized access to an electronic copy of your Allegis Group, Inc., or Allegis Group, Inc. subsidiary (“Allegis”), W-2 tax form. We take the protection of such information very seriously. Accordingly, out of an abundance of caution, we are notifying a broad group of individuals who may have been affected.What Happened?TALX provides payroll-related services for Allegis, your current or former employer, that you are able to access through TALX’s online portal available at www.mytaxform.com or https://PaperlessPay.TALX.com/allegis (“online portal”). We recently discovered that an unauthorized third-party(ies) accessed the accounts of certain employees during various time periods from January 4, 2016 through March 29, 2017. Upon learning of the unauthorized access, TALX and Allegis worked together promptly to understand what happened, and determined that, in some instances, the unauthorized third-party(ies) successfully answered personal questions about the affected employees in order to reset the employees’ PINs (i.e., the password to access the online portal). We have no indication that either TALX or Allegis was the source of any of the information used to reset the PINs and access the accounts. While we are continuing to investigate the incident, out of an abundance of caution, we are notifying a broad group of individuals who may have been affected.What Information Was Involved?An unauthorized third-party(ies) may have accessed an electronic copy of your W-2 tax form, which includes your name, address, Social Security number, and earnings information. The unauthorized third-party(ies) may have also accessed other information maintained in your online portal account, including your name, address, phone number, date of birth, Social Security number, wage and direct deposit information, employee identification number, email address, gender, and marital status.\"", "Information Source": "Maryland Attorney General", "Source URL": "http://www.marylandattorneygeneral.gov/Pages/IdentityTheft/breachnotices.aspx?subfolder=2015", "Year of Breach": 2014, "Latitude": 38.627003, "Longitude": -90.199404}