{"Date Made Public": "2017-07-05", "date": "2017-07-05", "Company": "Erie County Office of Children and Youth", "City": "Erie", "State": "Pennsylvania", "Type of breach": "DISC", "Type of organization": "GOV", "Total Records": 30, "Description of incident": "\"Officials with the Erie County Office of Children and Youth said that fewer than 30 Erie County children had their identities compromised as part of a recent data security breach involving a third-party vendor that affected approximately 1,800 child welfare cases statewide.The data breach was discovered in May and involved what is known as Child Accounting and Profile System databases maintained by Avanco International, a Fairfax, Virginia-based company that specializes in software integration, contracting and consulting for federal, state and local governments.The information has since been removed from the Internet.WJAC-TV in Johnstown reported the data breach was discovered after a Pennsylvania-based child welfare worker found a link on the internet to a client file, which should not have been viewable online.Erie County and several other counties statewide use that system, county OCY Director Lana Rees said.\"It's a system we input our (case) files into,\" Rees said, adding that names, dates of birth and Social Security numbers would be included in the database. \"The problem has been corrected.\"Rees said she did not know how long the information was viewable onlineLetters were sent to affected individuals or their families on June 30, she said, and the County Commissioners Association of Pennsylvania worked with county government solicitors across the state on a probe into what caused the data breach.CCAP is a statewide association that represents county commissioners, chief clerks, administrators and solicitors. It also represents county council members and executives in home-rule charter counties such as Erie County.The organization, according to Erie County officials, also consulted with lawyers expert in cyber law and a digital forensics company regarding the data breach, and put protective measures in place. There is no indication that the information was inappropriately used, officials said.\"", "Information Source": "Maryland Attorney General", "Source URL": "http://www.marylandattorneygeneral.gov/Pages/IdentityTheft/breachnotices.aspx?subfolder=2015", "Year of Breach": 2014, "Latitude": 42.129224, "Longitude": -80.085059}