{"Date Made Public": "2017-07-13", "date": "2017-07-13", "Company": "Walk in the Word Ministries", "City": "Elgin", "State": "Illinois", "Type of breach": "HACK", "Type of organization": "NGO", "Total Records": 0, "Description of incident": "\"What happened and what information was involved: On May 30, 2017, we were notified by our third-party e-commerce provider that an unknown individual may have accessed your credit card, debit card, or checking account information used to donate to WITW on our website. Because we take the security of your personal information very seriously, we are bringing this information to your attention as quickly as prudently possible, so you can take action along with us to hopefully eliminate any potential harm. When WITW became aware of the incident, we immediately took action to ensure the third-party vendor’s system was fixed and secure. At the same time we commenced an investigation to determine what information may have been accessed. We also have notified law enforcement and are cooperating with their investigation. We determined that the unknown individual may have accessed payment information, including name, address, telephone number, credit/debit card, or checking account information depending on the form of payment you used on our website. What we are doing and what can you do: Out of an abundance of caution, please consider reviewing your past and current card statements for unusual or suspicious activity and, if any is found, report it to your bank or credit card Company. Additional tips for protecting your information can be found on the reverse side of this letter. We want to assure you that we have taken steps to prevent a similar event from occurring in the future and to protect the privacy and security of your information. We have worked with the third-party vendor to address the vulnerabilities in its payment processing system, moved our website to a separate server with increased security, and now have an additional layer of continuous security monitoring. All of the steps we have taken are to further enhance security in order to prevent a similar event from occurring in the future, thereby protecting the privacy and security of your information going forward.\"", "Information Source": "Maryland Attorney General", "Source URL": "http://www.marylandattorneygeneral.gov/Pages/IdentityTheft/breachnotices.aspx?subfolder=2015", "Year of Breach": 2014, "Latitude": 42.035408, "Longitude": -88.282567}