{"Date Made Public": "2017-07-22", "date": "2017-07-22", "Company": "Washington State University", "City": "Olympia", "State": "Washington", "Type of breach": "PHYS", "Type of organization": "EDU", "Total Records": 1000000, "Description of incident": "\"When thieves broke into an Olympia storage locker in April and hauled away an 85-pound locked safe, they set in motion a series of events that forced Washington State University to send letters to 1 million people advising them their data might have been compromised.The safe contained a computer hard drive — a backup containing personal information, including Social Security numbers, that was stored off-site by WSU’s Social & Economic Sciences Research Center. The center, a research arm of the university, contracts with state agencies to evaluate the quality of the data those agencies are collecting, said Phil Weiler, vice president for marketing and communication at WSU.WSU doesn’t have any idea if the thieves were able to break into the safe, if they know what to do with the hard drive, or if they’re able to interpret the data, which is stored in a relational database that requires some expertise to unravel, Weiler said. In addition, some of the files were encrypted, and some were password protected, he said.But there’s certainly a chance they’ll figure it out, which is why WSU hired a computer-forensics firm to determine what data had been backed up onto the hard drive. This month, WSU sent letters to 1 million people warning them of the breach. The university is offering those affected a year subscription to free credit-monitoring and identity-theft protection.The data includes names and a mix of personal information, including Social Security numbers for some of those affected. Some of it comes from school districts who track their students after graduation to find out if they’re going on to college, or getting jobs, Weiler said. The research center also has contracted with state job-training programs that track their clients to see if they were able to find employment.Weiler said the hard drive contained data from 1998 to 2013. Some of the research center’s work includes long-term studies that track participants over many years.\"", "Information Source": "Maryland Attorney General", "Source URL": "http://www.marylandattorneygeneral.gov/Pages/IdentityTheft/breachnotices.aspx?subfolder=2015", "Year of Breach": 2014, "Latitude": 47.037874, "Longitude": -122.900695}