{"Date Made Public": "2016-09-02", "date": "2016-09-02", "Company": "Noble House Hotels and Resorts (Noble House)", "City": "Kirkland", "State": "Washington", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"Noble House Hotels & Resorts (Noble House) values the relationship it has with its guests and understands the importance of protecting your personal information.  Regrettably, we are writing to inform you about an incident that may involve some of your information. What Happened?We began an investigation after we were notified by the Secret Service about possible fraudulent activity on the payment card system at one of our properties.  We engaged a computer security firm to examine the payment systems at all of the properties we manage for any signs of an issue. Through our investigation, we learned that malware may have been  installed on payment processing systems that potentially affected cards swiped at the following hotels, restaurants, and bars during the periods identified:Kona Kai Resort & Spa, San Diego, CA, including the Vessel restaurant and the Tiki Bar,from April 25, 2016 - August 3, 2016;Little Palm Island Resort & Spa, Florida Keys, FL, including the Little Palm Island Dining Room, from April 25, 2016 - June 8, 2016;The Portofino Hotel & Marina, Redondo Beach, CA, including the Baleen Kitchen & Lounge restaurant and the Living Room Bar, from April 26, 2016 - June 8, 2016;The Edgewater, Seattle, WA, including the Six Seven restaurant, from April 26, 2016 - August 3, 2016;River Terrace Inn, Napa, CA, including the Terrace Café & Wine Bar, from April 25,2016 - June 8, 2016;LaPlaya Beach & Golf Resort, Naples, FL, including the Baleen restaurant and the Tiki Bar, from April 26, 2016 - August 3, 2016;Mountain Lodge at Telluride, Telluride, CO, including The View restaurant, from April 26, 2016 - August 5, 2016;Hotel Deca, Seattle, WA from April 25, 2016 - June 8, 2016;Blue Mermaid restaurant, San Francisco, CA from April 26, 2016 – August 3,2016;Pescatore restaurant, San Francisco, CA from April 26, 2016 – August 3,2016. What Information Was Involved?The information potentially compromised involved data found in the magnetic stripe on payment cards, which included your payment card number, payment card expiration date, CVV number, and may have included your name.\"More Information: http://oag.ca.gov/ecrime/databreach/reports/sb24-63728", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2016, "Latitude": 47.681488, "Longitude": -122.208735}