{"Date Made Public": "2016-10-24", "date": "2016-10-24", "Company": "Silver Creek Fitness & Physical Therapy", "City": "San Jose", "State": "California", "Type of breach": "DISC", "Type of organization": "MED", "Total Records": 0, "Description of incident": "\"On September 11, 2016, we were notified by our billing and software companies that their Amazon “S3” storage account was vulnerable because it  was accessible to persons outside their organization, and that a security  researcher who works for a software company accessed and downloaded  information from the account.    This storage account contained, among other things, protected health  information of certain Silver Creek Fitness & Physical Therapy, Silver Creek  Physical Therapy Gilroy, Silver Creek Physical Therapy Sunnyvale, and Silver  Creek Physical Therapy Los Gatos patients. The billing and software companies immediately took steps to secure the storage account and  launched an investigation to determine whether any sensitive information was accessed or  acquired. They determined that  the  storage account was vulnerable from  May, 2016 to September 11, 2016. However, we have no indication that any fraud has resulted from this incident.    While we have no indication that any fraud has resulted from this incident, we have confirmed that the data affected by this incident possibly included your name, Medicare number, prescription, date of birth, treatment location, treatment date, Social Security number, drivers license number, and progress notes. This information may have been downloaded by the security researcher on or around September 10, 2016 and may have been accessible to individuals who were able to access the “S3” account.\"More Information: https://oag.ca.gov/ecrime/databreach/reports/sb24-64521", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2016, "Latitude": 37.338208, "Longitude": -121.886329}