{"Date Made Public": "2016-11-03", "date": "2016-11-03", "Company": "National Wholesale Incorporated", "City": "Lexington", "State": "North Carolina", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "On  October  14,  2016,  National  Wholesale  discovered  that it  had  been  the  victim  of  a computer  related  incident. Unknown individuals targeted our website and inserted harmful code.   This code allowed unauthorized individuals to monitor the information our customers typed into the website when placing an online order.  We believe that the information of 14,281 of our customers may have been compromised; we are notifying you because our records indicate that you placed an order on www.shopnational.com during the relevant time periods.National  Wholesale  immediately  removed  the  malicious  software,  began  an  investigation, and  engaged IT  security firms to assist in repairing and securing our website.We also reported the incident to the FBI. Findings from the investigation show that if  a  customer  placed  an  order  on  our  website  from September 1,  2016  through  October  15,  2016,  information associated with the order being placed, including the customer’s name, address, phone number, email address, payment card number, expiration date and credit card security code (CVV) may have been obtained by unauthorized individuals.  If you placed an  order  as  an  existing  National  Wholesale  customer  during this  same time  period,  your  username  and  password  to  your account  may  have  also  been  exposed.Please  be  aware  that  National  Wholesale  does  not  receive  or  retain your  credit  card information when  you  place  an order. However,  given  the  nature  of  this incident,  it  is  possible  that  your  credit  card  number was intercepted when you typed it into the website.More Information: https://oag.ca.gov/ecrime/databreach/reports/sb24-64682", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2016, "Latitude": 35.829288, "Longitude": -80.271161}