{"Date Made Public": "2013-10-21", "date": "2013-10-21", "Company": "Court Ventures", "City": "Anaheim", "State": "California", "Type of breach": "INSD", "Type of organization": "BSO", "Total Records": 3100000, "Description of incident": " Between October 2010 and December 2012, Court Ventures, a public records aggregator, provided access to US Info Search data to a foreign criminal posing as a legitimate private investigator. Court Ventures had a contract with US Info Search where customers of Court Ventures had access to US Info Search data which included records on more than 200 million Americans, including individuals' Social Security numbers, dates of birth, and other records. Experian purchased the assets of Court Ventures in March 2012, and the criminal's access to the US Info Search data was shut down in December 2012. Experian has publicly stated that no Experian databases were breached in this situation.UPDATE (3/10/2014): According to Krebs on Security, in March 2014, Hieu Minh Ngo pled guilty to running an identity theft business called Superget.info out of his home in Vietnam.  Ngo posed as a private investigator when he contracted with Court Ventures to gain access to consumer records. Ngo was then able to provide access to the US Info Search database to his clients.Krebs on Security states, \"The government alleges that the service's customers used the information for a variety of fraud schemes, including filing fraudulent tax returns on Americans, and opening new lines of credit and racking up huge bills in the names of unsuspecting victims. The transcript shows government investigators found that over an 18-month period ending Feb.2013, Ngo's customers made approximately 3.1 million queries on Americans.\"Krebs adds, \"That means that if Ngo's clients conducted 3.1 million individual queries, the sheer number of records exposed by Ngo's service is likely to have been many times that number - potentially as many as 30 million records.\"More Information: http://krebsonsecurity.com/tag/court-ventures/UPDATE (2/23/2015): The total number of records indicated here has been changed to 3.1 million by PRC to reflect the approximate number of records queried by Ngo's customers according to the court transcript. [This 3/10/14 UPDATE was amended on 2/23/15 to include additional content from the Krebs on Security blog post of March 10, 2014, related to the Court Ventures breach.]UPDATE (7/15/2015): Hieu Minh Ngo, the Vietnamese man who perpetrated an online identity theft service and had access to personal information on more than 200 million Americans was sentenced to 13 years in a U.S prisonUPDATE (7/21/2015): A class action lawsuit has been filed against Experian as a result of their subsidiary, Court Ventures, allowed access to personal information of individuals by one individual who posed as a private invegtigator. \"The suit alleges that Experian negligently violated consumer protection  laws when it failed to detect for nearly 10 months that a customer of  its data broker subsidiary was a scammer who ran a criminal service  that resold consumer data to identity thieves.\"Read more regarding the suite here:http://krebsonsecurity.com/wp-content/uploads/2015/07/Experian-Ngo-Compl...More Information: http://krebsonsecurity.com/2015/07/experian-hit-with-class-action-over-i...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2013, "Latitude": 33.836593, "Longitude": -117.914301}