{"Date Made Public": "2014-01-07", "date": "2014-01-07", "Company": "Risk Solutions International LLC, Loudoun County Public Schools", "City": "Ashburn", "State": "Virginia", "Type of breach": "DISC", "Type of organization": "EDU", "Total Records": 0, "Description of incident": "Loudoun County school officials have responded to a data breach that made publicly available personal information about students and staff members, along with detailed emergency response plans for each school.More than 1,300 links could be accessed through a Google search, thought to be password protected, unveiled thousands of detailed documents as to how each school in the district will respond to a long list of emergencies, which included the staging areas for response teams as well as where the students and staff would be located during an emergency.Additional documents that could be accessed included students' courrse schedules, locker combinations, home addresses, phone numbers and birthdates along with the address and cell phone numbers for many school administrators.The contractor Risk Solution International acknowledged that the breach was caused by \"human error\" on their part, which is said to be the cause of the data breach. UPDATE: Loudoun County Public Schools administrators released a more detailed statement about the information made publicly available on the Internet due to errors committed by the contractor Risk Solutions International (RSI).According to school officials, the investigation is continuing as to how the webpage, which was made accessible through online search engines without any password protection happened. The page included 1,286 links detailing information on 84 Loudoun schools. It is unknown how long the information was exposed or how many links were opened by unauthorized individuals.Locker combinations were revealed for one school and only one parent contact information was revealed for fewer than 10 schools according to the spokesperson for the district. The statement also made clear that RSI's website was not hacked and that it never lost its password security. Instead, the breach occurred when RSI employees were doing technical testing on November 4th , December 19th and December 24th 2013. (1/9/2014)", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 39.033554, "Longitude": -77.517474}