{"Date Made Public": "2014-01-10", "date": "2014-01-10", "Company": "Neiman Marcus", "City": "Dallas", "State": "Texas", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 1100000, "Description of incident": "Neiman Marcus confirmed that its database of customer information was hacked last month, around mid-December, the same time that Target stores were targeted. The case is similar to the Target case in that only retail shoppers were affected, no online shoppers were affected. The cause, size and duration of the attack are not yet known and should start to be revealed once a third party investigation is completed. The company is also working with the Secret Service, which is customary in these types of attacks.UPDATE (1/16/2014): It has been reported that the breach at Neiman Marcus could as far back as July 2013 and that the breach was not fully contained until Sunday January 12, 2014. Neiman Marcus is still not communicating the total amount of individuals affected, but did comment that \"some of their customers\" payment cards were used fraudulently and have taken steps to notify those customers. They still do not believe that Social Security numbers or birth dates were affected.UPDATE (1/25/2014): Neiman Marcus released a statement that approximately 1.1 million individuals have been affected by the recent data breach to their system.UPDATE (7/21/105): A lawsuit filed against Neiman Marcus for the data breach it suffered in 2014 and may have started as far back as 2013, has been ruled to have standing.\"The United States Court of Appeals for the Seventh Circuit held that  data breach victims suffer injury for purposes of Article III standing  and can thus have their day in court against companies who fail to  protect their personal information from hackers.   The class action against Neiman Marcus alleged that the data breach  plaintiffs suffered injuries even if they have not yet been victims of  identity theft or other fraud. These injuries include an increased risk  of future fraudulent charges and greater susceptibility to identity  theft. Chief Judge Wood noted that “the Neiman Marcus customers should  not have to wait until hackers commit identity theft or credit-card  fraud in order to give the class standing, because there is an  ‘objective reasonable likelihood’ that such an injury will occur.” More Information: http://www.ktul.com/story/29599640/data-breach-plaintiffs-have-standing-...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 32.780732, "Longitude": -96.797295}