{"Date Made Public": "2016-11-23", "date": "2016-11-23", "Company": "Atlantis, Paradise Island", "City": "", "State": "Grand Bahama", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"Atlantis, Paradise Island (the “Resort”) today announced that a recent data security incident may have compromised the security of payment information of some customers who used debit or credit cards at food and beverage and retail locations at the Resort between March 9, 2016 and October 22, 2016. Customers can now safely use their credit and debit cards at the food and beverage and retail locations at the Resort. This incident did not affect credit and debit cards used to make or pay for hotel reservations or purchases made by guests who charged their food and beverage or retail purchases back to their room.What Happened? The Resort began investigating unusual activity after receiving reports from its credit card processor. The Resort immediately began working with third-party forensic experts to investigate these reports and to identify any signs of compromise on its computer systems. On October 21, 2016, the Resort discovered suspicious files on its computer systems that indicated a potential compromise of customers’ credit and debit card data for some credit and debit cards used at food and beverage and retail locations at the resort.Since that time, the Resort has been working with third-party forensic investigators to determine what happened and what information was affected. The Resort has confirmed that malware may have captured data from some credit and debit cards used at food and beverage and retail locations at the Resort. The Resort has removed the malware at issue to contain this incident and implemented additional procedures in an effort to prevent any further unauthorized access to customers’ credit and debit card information. This incident did not affect credit and debit cards used to make or pay for hotel reservations or purchases made by guests who charged their food and beverage or retail purchases back to their room.What Information Was Involved? Through the ongoing third-party forensic investigations, the Resort confirmed that malware may have captured credit and debit card data from some credit and debit cards used at food and beverage and retail locations between March 9, 2016 and October 22, 2016. The information at risk as a result of this event for credit or debit cards used at the impacted locations includes the card number, expiration date, CVV and in some instances, cardholder name. This incident did not involve customers’ Social Security numbers as this information is never collected by the Resort. This incident did not involve customers’ PIN numbers, either.\" ", "Information Source": "California Attorney General", "Source URL": "https://oag.ca.gov/ecrime/databreach/reports/sb24-65066", "Year of Breach": 2016, "Latitude": 26.659447, "Longitude": -78.52065}