{"Date Made Public": "2014-01-17", "date": "2014-01-17", "Company": "E-Benefits Department of Veteran Affairs", "City": "", "State": "District Of Columbia", "Type of breach": "UNKN", "Type of organization": "GOV", "Total Records": 0, "Description of incident": "As reported by a local T.V station in Moore County North Carolina, a Navy veteran  reported to have been utilizing the E-Benefits portal through the Department of Veteran Affairs to check his own benefits. He was on the VA's E-Benefits website trying to track down his own  history for a bank loan. Instead, windows kept popping up  displaying  other veterans' medical and financial information. He has since reported the issue to the Department of Defense, the VA and Senator Kay Hagan's office. The VA has responded with a statement to ABC11 on Friday January 17, 2014 with the following: \"The Department  of Veterans Affairs (VA) takes seriously our obligation to properly  safeguard personal information.  Wednesday evening, during a process to  improve software supporting the joint VA and Department of Defense  benefits web portal  eBenefits, VA discovered a software defect. During  that limited timeframe, some Veterans and Servicemembers who had  registered and logged into eBenefits were able to see a combination of  their own information as well as data from other eBenefits users.  VA  took immediate action upon discovering the software defect and shut the  eBenefits system down in order to limit any problems.  VA is conducting a  full review to be certain the underlying technological issues have been  resolved before the system is returned to operation. VA's  independent Data Breach Core Team (DBCT) is reviewing this issue and  believes a relatively limited number of Veterans have been affected.  Once the DBCT determines the number of users impacted, their identities  and other pertinent facts, VA will take the appropriate response, which  may include free credit monitoring for the affected individuals,  consistent with VA's standard practice\".", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 38.907192, "Longitude": -77.036871}