{"Date Made Public": "2014-01-25", "date": "2014-01-25", "Company": "Michaels Stores Inc.", "City": "Irving", "State": "Texas", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 2600000, "Description of incident": "On January 25, 2014, Michaels Stores Inc. communicated with customers as to the possibility of a security breach regarding customers payment cards. They have not confirmed as of yet, that a breach did occur, however based on a preliminary investigation and in light of the recent Target and Neiman Marcus breaches, the company felt it was important to warn customers of the possibility of a breach. Michaels is currently working with investigators as to the potential of this breach.  No additional detailed information has been supplied by the company.UPDATE (2/11/2014): A class action lawsuit has been filed against Michaels by an individual. The suit claims that \"the arts and crafts  supplier failed to secure and safeguard customers’ private financial  information\".  The suit also alleges that \"Michaels failed to adequately monitor  its payment systems in such a manner that would enable the retailer to  detect fraud or other signs of tampering so that the breach of security  and diversion of customer information was able to continue unnoticed  for a period of time\".It has also been reported that  Michaels failed to disclose a data breach that occurred in May of 2011. A  lawsuit was filed for the 2011 breach, but was settled. The  company has not yet released the total number of individuals affected by  the breach or when the breach might have taken place.UPDATE (7/22/2014): \"A federal court in Illinois held July 14 that an elevated risk of identity theft from a Michaels Stores Inc. breach provides standing, but without evidence of specific monetary damages that risk is insufficient to support statutory or common law claims (Moyer v. Michaels Stores, Inc., N.D. Ill., No. 1:14-cv-00561,dismissed 7/14/14).Judge Elaine E. Bucklo of the U.S. District Court for the Northern District of Illinois dismissed the case against the arts and crafts retailer, finding that the plaintiffs failed to plead monetary damages\". ", "Information Source": "Media", "Source URL": "", "Year of Breach": 2013, "Latitude": 32.915281, "Longitude": -96.98862}