{"Date Made Public": "2014-03-05", "date": "2014-03-05", "Company": "Sally Beauty Supply", "City": "Denton", "State": "Texas", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 25000, "Description of incident": "As reported by Krebs on Security, it appears that Sally Beauty Supply may be one of the latest victims of a string of credit card data breaches affecting their payment systems.\"On March 2, a fresh batch of 282,000 stolen credit and debit cards went on sale in a popular underground crime store.  Three different banks contacted by KrebsOnSecurity made targeted purchases from this store, buying back cards they had previously issued to customers\".The banks used a \"common point of purchase\" or \"CPP\" to determine where the cards were used over the same period of time. \"Each bank independently reported that all of the cards (15 in total) had been used within the last ten days at Sally Beauty Supply locations across the United States\".The company had also detected some kind of intrusion into their network at or around the same time that the stolen card mapping or \"CPP\" dates that the banks found associated with Sally Beauty Supply. The company's initial investigation did not show any evidence that data was compromised at the store level. The company hired Verizon Enterprise Solutions for the initial and continued investigation.UPDATE (3-17-2014): Sally Beauty has confirmed that the breach they suffered was due to hackers breaking into their network, stealing credit card data from stores. Originally the retailer would not confirm that they suffered a breach as they had no evidence that any credit card data was stolen. The company confirmed that \"fewer than 25,000 records containing card present (track 2) payment card data have been illegally accessed on our systems and we believe have been removed.\" The company also states \" As experience has shown in prior data security incidents at other companies, it is difficult to ascertain with certainty the scope of a data security breach/incident prior to the completion of a comprehensive forensic investigation. As a result, we will not speculate as to the scope or nature of the data security breach.\"", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 33.214841, "Longitude": -97.133068}