{"Date Made Public": "2014-04-18", "date": "2014-04-18", "Company": "University Pittsburgh Medical Center", "City": "Pittsburgh", "State": "Pennsylvania", "Type of breach": "HACK", "Type of organization": "MED", "Total Records": 62000, "Description of incident": "The University Pittsburgh Medical Center (UPMC) informed employees of a data breach that compromised employee's personal data, including their Social Security number and  the potential for fraudulent tax returns being filed in their name. The number of employees affected was approximately 800. The full extent of the information exposed has not been communicated, however, due to the tax fraud, information such as names, addresses and Social Security numbers were assumed to be involved. UPMC was aware of the breach in February and thought that the breach included only 27 individuals, but soon became aware that the breach was much larger. An investigation is currently being conducted.UPDATE (4/21/2014): The extent of the data breach at UPMC thought to be around 800 employees, is much more extensive than originally believed. The current numbers are around 27,000 employees affected. UPMC is offering Lifelock for 12 months for those affected. A letter went out to those individuals with the information. For additional questions, UPMC has provided a toll free hotline (1-855-306-8274) or email JohnHouston@upmc.edu. A class action lawsuit has been filed against UPMC.UPDATE (5/14/2014): On Friday May 9, 2014 the law firm of Kraemer, Manes & Associates sued University Pittsburgh Medical Center (UPMC) and Ultimate  Software Group of Weston, Fla., over the loss of employee data and  subsequent identity thefts. They are seeking class-action status in U.S.  District Court, and would represent current and former UPMC employees  who have been affected by the breach.UPDATE (2/8/2017): Based on current media, our numbers have been increased to 62,000 individual records breachedMore information: https://www.scmagazine.com/umpc-found-to-have-no-legal-duty-to-protect-e...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 40.440625, "Longitude": -79.995886}