{"Date Made Public": "2014-06-06", "date": "2014-06-06", "Company": "Miami-Dade County", "City": "", "State": "Florida", "Type of breach": "UNKN", "Type of organization": "GOV", "Total Records": 0, "Description of incident": "The county of Miami-Dade informed employees of a data breach where their personal information is being used to file fraudulent unemployment claims, along with credit card fraud. Currently, officials at the county are not clear if this breach happened internally or by external hackers.They have not released what specific information has been compromised.Federal officials at the U.S Inspector General's Office are leading the investigation due to false unemployment claims. The Human Resource Department of the agency has put out a statement.\"The recent news report on a “Data Breech” has  understandably raised concerns amongst our employees regarding their  personal information and whether they are one of the employees impacted  by identity theft.  Please be advised that when we identify a possible  fraudulent unemployment claim, we immediately notify the Departmental  Personnel Representative (DPR) for that employee.  Our procedures are as  follows:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  The Human Resources Department  receives the Notices of Reemployment Assistance once a claim for  unemployment has been filed with the Department of Employment  Opportunity (DEO).  If a claim is identified as fraudulent (once HR  confirms the employee is an active employee) HR contacts the employee’s  DPR to provide notice to the Department and notification is immediately  sent to the Department of Unemployment indicating that it is a  fraudulent claim.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  If an employee is notified that a  fraudulent claim has been filed on their behalf, the employee should be  instructed to do the following:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     Contact the Unemployment Fraud Hotline to report the fraud at (800) 342-9909(800) 342-9909.  They should report that their identity (SS#, Name) is being used to commit Unemployment Fraud.Make a note of the Master Case File # that has been assigned by the Miami-Dade Police Department:PD130322106429.File an Identity Theft Affidavit (IRS Form 14039), found at http://www.irs.gov/pub/irs-pdf/f14039.pdfNotify their banking institutionsMake routine checks on their bank accountsConduct thorough reviews on their bank and credit card statementsVisit http://myfloridalegal.com/identitytheft to learn more about Identity Theft  We assure you that fraudulent claims are being taken very seriously and  every effort is being made to identify and refer these cases to the  proper authorities for appropriate action.\"CallSend SMSAdd to SkypeYou'll need Skype CreditFree via Skype", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 27.664827, "Longitude": -81.515754}