{"Date Made Public": "2014-10-20", "date": "2014-10-20", "Company": "Staples Inc.", "City": "Framingham", "State": "Massachusetts", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 1200000, "Description of incident": "Several large banks notified Staples Inc. of unusual activity on credit and debit cards used at several locations in Northeastern United States.  According to Brian Krebs, Krebs on Security   \"According to more than a half-dozen sources at banks operating on the East Coast, it appears likely that fraudsters have succeeded in stealing customer card data from some subset of Staples locations, including seven Staples stores in Pennsylvania, at least three in New York City, and another in New Jersey\".  Staples Inc. has more than 1800 stores nationwide and is currently investigating the potential breach.  More Information: http://krebsonsecurity.com/2014/10/banks-credit-card-breach-at-staples-s...UPDATE (11/17/2014): It appears that the breach that happened at Staples was conducted by the same cyber criminals that infiltrated Michaels stores. According to Krebs On Security \"Multiple banks interviewed by this author say they’ve received alerts from Visa and MasterCard  about cards impacted in the breach at Staples, and that to date those  alerts suggest that a subset of Staples stores were compromised between  July and September 2014.\"More Information: http://krebsonsecurity.com/2014/11/link-found-in-staples-michaels-breach...UPDATE (12/19/2014): After an investigation, Staples Inc. said that nearly 1.2 million customers payment cards. \"Staples said Friday that the investigation revealed that the hackers used malware that provided access to information for transactions at 115 of its stores. The hackers stole cardholder names, payment card numbers, expiration dates and card verification codes.  The company is offering free identity theft protection services.More Information: http://www.huffingtonpost.com/2014/12/19/staples-breach-payment-cards_n_...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 42.279286, "Longitude": -71.416157}