{"Date Made Public": "2014-11-24", "date": "2014-11-24", "Company": "Sony Pictures", "City": "New York", "State": "New York", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 47000, "Description of incident": "Sony Pictures Entertainment has suffered a data breach when hackers posted threatening messages on company computers. According to a report the threat \"began with a skull appearing on screens, and then a strangely ominous  message telling users they’d been hacked by something called #GOP. It  gets more bizarre as the message claims this is just the beginning and  then threatens to release documents by 11 PM this evening.\"The company has completely shut down all email communications and employees are not allowed to use company computers while the entertainment giant works through where and what the threat is and if it is real. The original threat did not give specifics or communicate any kind of \"ransom\" for the data that had supposedly been hacked.More Information: https://deadline.com/2014/11/sony-computers-hacked-skull-message-1201295... UPDATE (12/5/2014): A data security analyst has discovered information leaked by the hacker (s) goes beyond what was originally reported.According to the security company Identity Finder, showed that leaked files included vast amount of personal data on \"more than 47,000 celebrities, freelancers, and current and former Sony employees\".   \t\"An analysis of 33,000 leaked Sony Pictures documents by data security  software firm Identity Finder showed that the leaked files included the  personal information, salaries and home addresses for employees and  freelancers who worked at the studio. Some of the celebrities include  Sylvester Stallone, director Judd Apatow and Australian actress Rebel  Wilson, according to the Wall Street Journal, which first reported on the analysis\".  \tAdditional information such as contracts, termination dates, termination reason and other data was also leaks. Unfortunately these files were in Excel format without any password protection.More Information: http://www.cnet.com/news/sony-hack-said-to-leak-47000-social-security-nu...UPDATE (12/16/2014): \"Sony Pictures Entertainment has been sued by two self-described former employees who accuse the movie studio of failing to protect Social Security numbers, healthcare records, salaries and other data from computer hackers who attacked it last month. The proposed class action lawsuit against Sony Corp's   studio was filed on Monday in federal court in Los Angeles. It alleges that the company failed to secure its computer network and protect confidential information.\"More Information: http://www.reuters.com/article/2014/12/16/sony-cybersecurity-classaction...UPDATE (06/16/2015): Sony Pictures Entertainment has been denied a dismissal of a lawsuit brought on by former employees who claim that their personal data was stolen in the 2014 hacking. The judge stated \"Sony created a \"special relationship\" with its employees by requiring  them to provide personal information to be eligible for salaries and  benefits.\"More Information: http://www.businessinsider.com/r-sony-fails-to-dismiss-lawsuit-over-inte...UPDATE (09/02/2015): \"Lawyers for former Sony Pictures Entertainment  employees whose data was breached last year say they have tentatively  reached a settlement with the company.  Wednesday's filing in a proposed class-action lawsuit does not detail  settlement terms or how many current and former Sony employees would be  covered by the settlement.  Plaintiffs' attorney Daniel Girard wrote that he and fellow lawyers  believe the settlement is favorable to employees whose personal,  financial and medical information was posted online.  Additional details about the settlement are expected to be filed in a Los Angeles federal court by mid-October.\"More Information: http://www.usnews.com/news/entertainment/articles/2015/09/02/federal-son...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2014, "Latitude": 40.712784, "Longitude": -74.005941}