{"Date Made Public": "2015-06-29", "date": "2015-06-29", "Company": "State Department", "City": "Washington", "State": "District Of Columbia", "Type of breach": "INSD", "Type of organization": "GOV", "Total Records": 0, "Description of incident": "Two brothers, Muneeb and Sohaib Akhter, have pleaded guilty to various charges including conspiracy to access a protected computer without authorization, wire fraud, and accessing government computers without authorization.  Muneeb Akhter, pleaded separately to additional charges including accessing a protected computer without authorization, obstructing justice and making false statements. Muneeb Akhter \"stole thousands of customers' credit card details, along with other  personal information of consumers, by hacking into a cosmetic company's  website in March 2014. Then, the brothers and co-conspirators used to  the stolen data to purchase \"goods and services, including flights,  hotel reservations, and attendance at professional conferences,” The DOJ  release said. “Muneeb Akhter also provided stolen information to an  individual he met on the ‘dark net,' who sold the information to other  dark-net users and gave Akhter a share of the profits.” \"Sohaib Akhter was employed in a contract position with the State Department and begain obtaining passport and visa information, as well as additional sensitive data from the agency's servers. Sohaib \"devised a scheme to ensure that he could maintain  perpetual access to desired State Department systems. Sohaib Akhter,  with the help of Muneeb Akhter and co-conspirators, attempted to  secretly install an electronic collection device inside a State  Department building. Once installed, the device could have enabled  Sohaib Akhter and co-conspirators to remotely access and collect data  from State Department computer systems.  Sohaib Akhter was forced to  abandon the plan during its execution when he broke the device while  attempting to install it behind a wall at a State Department facility in  Washington, D.C.,” as communicated by a DOJ spokesperson. More Information: http://www.scmagazine.com/brothers-accused-of-state-dept-hack-plead-guil...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2015, "Latitude": 38.907192, "Longitude": -77.036871}