{"Date Made Public": "2017-01-19", "date": "2017-01-19", "Company": "CoPilot Provider Services Inc.", "City": "New Hyde Park", "State": "New York", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 220000, "Description of incident": "\"CoPilot maintains a particular website, www.monovischcp.com,1 used by physicians to help determine whether insurance coverage is available for ORTHOVISC® and MONOVISC® injections. This website may have been used by your physician’s office to make an inquiry about your insurance coverage for these injections. On December 23, 2015, CoPilot received complaints claiming that personal information submitted to the site, including health information, was accessible for downloading from the website. CoPilot immediately launched an investigation and retained a leading cybersecurity consulting firm to assist in its investigation of what occurred. As a result of CoPilot’s investigation, CoPilot believes that it identified the individual who accessed CoPilot’s database through unauthorized means and downloaded certain health information, and that the data was not accessible for downloading by the general public from the website. Subsequently, CoPilot referred the matter to law enforcement. Our understanding is that the law enforcement investigation supports CoPilot’s conclusion about the identity of the responsible individual. What Information Was Involved? The data accessed may have contained information such as your name, gender, date of birth, address, phone number, and medical insurance card information. It is important to note that your Social Security number was not included. No medical records, or specific diagnosis or treatment information was involved in this incident, although the fact that your information was in our database, in connection with other information, could suggest that an inquiry was made regarding whether you had insurance coverage for ORTHOVISC® or MONOVISC® injections.\"More information: https://oag.ca.gov/ecrime/databreach/reports/sb24-65922More information: http://www.beckershospitalreview.com/healthcare-information-technology/c...", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 40.735102, "Longitude": -73.687908}