{"Date Made Public": "2016-01-27", "date": "2016-01-27", "Company": "cPanel", "City": "Houston", "State": "Texas", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"Website administration firm cPanel told customers that it had been hacked over the weekend, potentially exposing contact information in the process.Customers' names, contact details, and encrypted (and salted) passwords were publicly aired due to a series of unfortunate events.Payment information, kept on a separate system, remains safe.Passwords ought to be safe too, but cPanel is taking the opportunity to get customers with older password encryption to change up anyway.“I am writing to let you know that one of our user databases may have been breached,” the firm warned customers in an email over the weekend (republished online here). “Although we successfully interrupted the breach, it is still possible that user contact information may have been susceptible.”“The customer contact information that may have been susceptible is limited to names, contact information, and encrypted (and salted) passwords. Please note that our credit card information is stored in a separate system designed for credit card storage and is not impacted by this possible breach.”“Although current passwords are stored salted and encrypted, we are accelerating our move to stronger password encryption at the same time in order to minimize disruption. In order to safeguard the system, we will force all users with older password encryption to change their passwords,” it added.This is a fairly minor breach and the main outcome – if crooks manage to get their hands on the potentially exposed contact info – is more convincing phishing emails.\"More information: http://www.theregister.co.uk/2016/01/27/cpanel_security_breach/", "Information Source": "Media", "Source URL": "", "Year of Breach": 2016, "Latitude": 29.808178, "Longitude": -95.444629}