{"Date Made Public": "2016-02-26", "date": "2016-02-26", "Company": "University California Berkeley", "City": "Berkeley", "State": "California", "Type of breach": "HACK", "Type of organization": "EDU", "Total Records": 80000, "Description of incident": "\"Campus officials are alerting nearly 80,000 current and former faculty, staff, students and vendors about a criminal cyber security breach on a campus system, making vulnerable thousands of Social Security or bank account numbers.The data breach occurred Dec. 28 to a portion of Berkeley Financial System, or BFS, a software used by the campus for financial management.“We don’t see any evidence that this is the kind of attacker that actually did access the data or did anything to take that data from the system,” said campus Chief Information Security Officer Paul Rivers in a phone press conference Friday.The system that houses BFS is large and complicated, Rivers said, containing numerous machines and various types of software packages. When the campus detected a vulnerability in one of these areas in November, the campus began installing and testing a security fix — known as a patch — which can take weeks, Rivers said during the press call. During this process, attackers were able to discover a security flaw and gained access to the system.BFS contains the information of about 50 percent of current students and 65 percent of active employees. Affected individuals largely include students, faculty and staff who received payments from the campus, mainly through electronic fund transfers. Those who received paper payments, however, may have also been affected.A private computer investigation firm was retained by the campus to further determine whether personal information was compromised. The campus will send notice letters in the mail with more information about free credit monitoring and insurance to those who were potentially impacted starting Friday.According to Rivers, this is the third significant breach UC Berkeley has seen in the past five years.Within a day of the unauthorized intrusion Dec. 28, the campus’s security team had detected and began efforts to contain the attack, according to campus spokesperson Janet Gilmore.Once campus IT staff identified the unauthorized access, they forensically preserved copies of the system for investigation purposes and took affected servers offline for about two weeks to prevent further access. When the campus shut down BFS and supporting systems, some students received emails in early January notifying them of possible disruptions to financial aid disbursements.\"More information: http://www.dailycal.org/2016/02/26/campus-notifies-nearly-80000-students...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2015, "Latitude": 37.871593, "Longitude": -122.272747}