{"Date Made Public": "2016-05-12", "date": "2016-05-12", "Company": "Joan Jett's BlackHeart Records", "City": "Hollywood", "State": "California", "Type of breach": "DISC", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"This week legendary rocker and Rock and Roll Hall of Fame Member Joan Jett had an unfortunate reminder of how important cyber security and data protection is in today’s digital world. On Dec 1st the MacKeeper Security Research Center discovered Joan Jett’s BlackHeart Records leaking hundreds of gigabytes of data online. BlackHeart Records is an Independent label founded by Joan Jett and Kenny Laguna and has a good reputation as an established label with a range of well known artists.The data breach is a massive treasure trove for fans and cyber criminals alike. There are unreleased tracks, never before seen pictures, even rejection letters from 1980 when Joan Jett was trying to get a record deal. There are also social security numbers of label employees and band members, internal memos and scanned checks of royalty payments and much more.From the entertaining obsessed fan emails to lawsuits and arrest records of the label manager, this database is a look inside of how the record label is operated and the communication between rock and roll royalty.Although there are no naked pictures or Hollywood style tabloid drama in the hundreds of gigabytes and countless thousands of files, there is a complete view of the many aspects of being a famous rockstar, operating a record label, and the meticulous documentation of every achievement, failure, or internal and external communications.With the social security numbers, banking information, scans of passports, and IDs it is easy to see that cyber criminals could have exploited this data for identify theft, fraud, or extortion. The data is now secured and it is not known how long that IP was publically available.\"More information: https://mackeeper.com/blog/post/307-joan-jetts-blackheart-records-leaks-...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2016, "Latitude": 34.092809, "Longitude": -118.328661}