{"Date Made Public": "2017-01-26", "date": "2017-01-26", "Company": "Cuddl Duds (Komar & Sons, Inc)", "City": "Jersey City", "State": "New Jersey", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"Cuddl Duds is writing regarding a recent data security incident that may impact certain payment card  information  used  by  you  at  our  e-commerce  website.    We  wanted  to  provide  you  with information about this incident, our response, and steps you can take to prevent fraud, should you feel it necessary to do so.   What Happened?  On or around December 1, 2016, we received reports of suspicious activity from our third party e-commerce partner.  We immediately began to investigate these reports to identify  what  happened  and  what  information was  impacted.    Third-party  computer  forensic investigators were retained to assist with the investigation into what happened and what data was impacted.  The investigation initially identified suspicious files on the system.  In an abundance of caution,  all  user  passwords  were  reset  as  this  incident  was  initially  determined  to  impact  only name,  address,  email  address,  and  encrypted  passwords. Further  investigation  identified a malicious  code  inserted  into  the  e-commerce  website.    Upon  identifying  the  malicious  code, Cuddl  Duds  and  its  partner  quickly  took  steps  to  remove  the  code  and  prevent  further unauthorized  access.  A  review  of  the  code  determined  that  it  was  capable  of  collecting information provided by customers on the checkout page of Cuddl Duds.   What Information Was Involved?  Cuddl Duds’s investigation has revealed that the malicious code collected demographic and credit card information entered on our e-commerce site checkout page  between  March  1,  2015  and  December  1,  2016.    The  information  collected  included  the cardholder’s  name,  shipping  address,  billing  address,  email  address,  card  number,  card  type, expiration date, and CVV.  If you were a registered user at our site, your login and password would also have been collected.  All user passwords were changed in December after the discovery of the files.\"More information: https://oag.ca.gov/ecrime/databreach/reports/sb24-66044", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2016, "Latitude": 40.715226, "Longitude": -74.033716}