{"Date Made Public": "2016-06-17", "date": "2016-06-17", "Company": "Bizmatics, Inc.", "City": "San Jose", "State": "California", "Type of breach": "HACK", "Type of organization": "MED", "Total Records": 177000, "Description of incident": "\"A healthcare provider in Colorado, Vincent Vein Center, is the latest  organization to notify the U.S. Department of Health and Human Services  (HHS) Office of Civil Rights (OCR) about a breach of protected health  information stemming from a malicious hacker attacking Bizmatics’ data  servers. Bizmatics provides ambulatory software and electronic health records serving 15,000 healthcare providers.\"Each customer/provider is reporting the specific numbers to Health and Human Services. We will be reporting the specific provider records breached as they are reported by HHS. The information provided to date knowledge of these following entities have been reported as affected by the Bizmatic breach.- Integrated Health Solutions- Pennsylvania- ENT & Allergy Center- Arkansas- Vincent Vein Center- Colorado- Southeast Eye Institute/Eye Associates of Pinellas- Florida- California Health  & Longevity Institute- California- Pain Treatment Centers of America and Intervential Surgery Institute- ArkansasAs further information is provided, we will add to this list and make an effort to call out the third party breach in each individual breach post of the entity if and when it is provided. UPDATE (6/28/2016): Two additional health providers have reported being a part of the Bizmatic breach. The Vein Doctor out of Liberty MO notified that 3,000 patients data had been affected by this data breach. Grace Primary Care. P.C. has also notified patients that they too were affected by the Bizmatic breach and 6,853 patients were potentially affected. Each of these entities have been reported separately within our Chron stating the number of patients affected by this breach. More Information: http://www.hipaajournal.com/bizmatics-data-breach-victim-count-rises-alm...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2016, "Latitude": 37.314635, "Longitude": -121.972668}