{"Date Made Public": "2016-08-15", "date": "2016-08-15", "Company": "HEI Hotels & Resorts", "City": "Norwalk", "State": "Connecticut", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"A hotel operator responsible for several high-profile hotels across the U.S. says it discovered a breach of its payment processing systems that may impact hotels in several states and The District of Columbia.In a statement Monday, HEI Hotels & Resorts says 20 hotels representing brands including Marriott, Starwood, Sheraton and Westin were impacted. HEI says they are working with law enforcement and financial institutions to address the breach. An outside forensic expert was also tapped to investigate the breach.\"We are pleased to report that the incident has now been contained and individuals can safely use payment cards at our properties,\" reads a statement from HEI.According to HEI, \"unauthorized individuals\" installed malware on its payment processing systems at these properties that can capture payment card information at the point of purchase.\"List of hotels affected: http://www.heihotels.com/list-of-propertiesMore Information: www.usatoday.com/story/tech/news/2016/08/15/major-hotel-operator-hit-dat...UPDATE (8/19/2016): \"All in all, 12 Starwood properties, 6 Marriott Properties and a single Hyatt hotel have been found to have been snagged in the breach. According to available data, the breach was active March 1, 2015 to June 21, 2016, with 14 of the hotels affected after Dec. 2, 2015, HEI said on its website on Friday.  IHG and Marriott have no comment on the breach at this point. According to HEI – customer names, account numbers, payment card expiration dates and verification codes are all likely to have been stolen.Affected properties include: Starwood’s Westin hotels in Minneapolis; Pasadena, California; Philadelphia; Snowmass, Colorado; Washington, D.C.; and Fort Lauderdale, Florida. Also affected were Starwood properties in Arlington, Virginia; Manchester Village, Vermont; San Francisco; Miami; and Nashville, Tennessee.The Marriott properties affected were in Boca Raton, Florida; Dallas-Fort Worth, Texas; Chicago; San Diego, California; and Minneapolis.\"More Information: http://www.pymnts.com/news/security-and-risk/2016/hei-data-breach-starwo...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2016, "Latitude": 33.902237, "Longitude": -118.081733}