{"Date Made Public": "2016-10-28", "date": "2016-10-28", "Company": "Office of the Comptroller of the Currency", "City": "Washington", "State": "District Of Columbia", "Type of breach": "INSD", "Type of organization": "GOV", "Total Records": 10000, "Description of incident": "\"A U.S. bank regulator on Friday disclosed a data breach involving a former agency employee’s unauthorized removal of more than 10,000 records. The cybersecurity breach at the Office of the Comptroller of the Currency was detected in September while the agency was undertaking a retrospective two-year review of employees downloading information in an effort to help minimize cyberthreats. The breach, flagged to Congress and three other government agencies including the Department of Homeland Security, occurred in November 2015 when a former employee downloaded a large number of files onto two thumb drives before retiring from the agency. The OCC said data on the thumb drives were encrypted and there is no evidence that data taken by the employee were “disclosed” or “misused.”An OCC spokesman said the files included information “related to OCC activities and employees.” He said there is “no indication that there was bank customer information among the files removed.”The agency said that once it discovered the data breach, it immediately referred the case to the Treasury Department’s Inspector General’s office. The OCC review concluded it was a “major incident,” involving more than 10,000 records and potentially exposing personal information. The former employee was identified only as a retiree who downloaded the information shortly before leaving the agency. Government agencies are required to report all “major incidents” to Congress; this is the first time the OCC has done so. The OCC said the data breach hasn’t “adversely affected” the agency’s internal operations.\"More Information: http://www.wsj.com/articles/u-s-bank-regulator-notifies-congress-of-majo... ", "Information Source": "Media", "Source URL": "", "Year of Breach": 2016, "Latitude": 38.907192, "Longitude": -77.036871}