{"Date Made Public": "2016-11-16", "date": "2016-11-16", "Company": "FriendFinder", "City": "Sunnyvale", "State": "California", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 412000000, "Description of incident": "\"A hack against popular adult dating and entertainment company FriendFinder Networks exposed data related to more than 412 million user accounts, according to a report from breach notification site LeakedSource. If the report is correct, that would make the breach one of the largest on record in terms of the number of accounts affected. It also would mark the second such incident at the company in two years.FriendFinder Networks did not confirm or deny the breach when reached by The Washington Post. But the company said in a statement that it had “received a number of reports regarding potential security vulnerabilities from a variety of sources” and that it is investigating. \"Immediately upon learning this information, we took several steps to review the situation and bring in the right external partners to support our investigation,\" the statement said.The Adult FriendFinder data stretched back 20 years and included information such as usernames, emails, join dates and the date of a user’s last visit, according to LeakedSource. Passwords were also included in the trove -- the vast majority of them featured unsecured protections or none at all, the report said.LeakedSource said the alleged breach includes nearly 340 million accounts from flagship site Adult FriendFinder, plus data from other sites owned by FriendFinder Network, including Cams.com, as well as records from Penthouse.com, which was sold in February. The cache may also include 15 million email addresses connected to deleted accounts, according to LeakedSource.\"More Information: https://www.washingtonpost.com/news/the-switch/wp/2016/11/14/adult-frien...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2016, "Latitude": 37.407315, "Longitude": -122.017311}