{"Date Made Public": "2016-12-16", "date": "2016-12-16", "Company": "Pentagon", "City": "Washington", "State": "District Of Columbia", "Type of breach": "HACK", "Type of organization": "GOV", "Total Records": 0, "Description of incident": "\"An unclassified email system used by the Pentagon was compromised by Russian hackers in 2015, forcing security teams to take the entire network down in order to fix the breach.Martin Dempsey, who was at that time Chairman of the Joint Chiefs, told CBS that he was informed of the breach by the Director of the National Security Agency, Admiral Mike Rogers, revealing that in approximately one hour, hackers seized control of the entire email system.However, Dempsey explains that the email service was used by staff of the Pentagon’s Joint Chiefs staff, which involves some 3,500 military officers and civilians who work for the chairman, and included only unclassified emails that “had no real intelligence value.”According to Dempsey, hackers managed to obtain passwords and electronic signatures that he personally used to access the network, so taking the entire system offline was the only way to deal with the problem.Russia-backed attackersAs for the identity of the hackers, the United States officials believed they were Russians who were trying to fight back at the Pentagon after the US issued economic sanctions against their country for the conflict in Ukraine and the annexation of Crimea.The attack was launched with compromised severs from a West Coast university, which were used to send a total of 30,000 emails. Four of them were eventually forwarded to Joint Chiefs of Staff employees and included malicious files that infected computers when executed. At least one of them was opened by an employee and eventually compromised the system before spreading across the entire network.\"More information: http://news.softpedia.com/news/russian-hackers-seized-control-of-pentago...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2016, "Latitude": 38.871857, "Longitude": -77.056267}