{"Date Made Public": "2017-02-27", "date": "2017-02-27", "Company": "Spiral Toys", "City": "Los Angeles", "State": "California", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 2000000, "Description of incident": "\"A company selling internet-connected stuffed toys used by kids and parents to send voice messages to one another leaked 800,000 user account credentials and 2 million message recordings, according to security researcher Troy Hunt. The data was hacked, locked and held for ransom.Researchers and journalists have been trying to reach the company, Spiral Toys, since late last year to confirm and fix the data breach and security problems for the CloudPets brand. No one has heard back from the manufacturers as the data hit the web and was passed around between hackers and researchers.The magnitude of problems and the nature of the victims — small children and families — have set up the CloudPets hack to be a textbook-example security failure for a long time to come. Spiral Toys is a virtually worthless company, according to its stock prices and activity. It does not appear to have a functioning phone number, and no one at Spiral Toys has answered an email on this issue for months, including messages sent Monday by CyberScoop.CloudPets’ data is stored in a public-facing MongoDB database without any authentication required. The database was indexed by search engines like Shodan and found independently by multiple individuals. There was no password to protect the database. Users have no password requirements on their own accounts and the site itself offers no security.In mid-January, as hackers attacked and ransomed thousands of critically vulnerable MongoDB databases, researchers saw the CloudPets database suffer the same fate. Unlike other databases, whose owners paid the ransom or at least responded to the demands, Spiral Toys appears to have been silent on the issue as the database was deleted and ransomed numerous times over the next several days.Sensitive data was exposed, Hunt wrote, and no parents were ever notified.\"More information: https://www.cyberscoop.com/internet-connected-teddy-bear-company-hacked-...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2017, "Latitude": 34.052234, "Longitude": -118.243685}