{"Date Made Public": "2017-02-27", "date": "2017-02-27", "Company": "Boeing", "City": "Seattle", "State": "Washington", "Type of breach": "DISC", "Type of organization": "BSO", "Total Records": 36000, "Description of incident": "\"A Boeing employee inadvertently leaked the personal information of 36,000 of his co-workers late last year when he emailed a company spreadsheet to his non-Boeing spouse.News of the breach surfaced earlier this month after a letter (.PDF) from Boeing’s Deputy Chief Privacy Officer Marie Olson, to the Attorney General for the state of Washington Bob Ferguson, was posted to Ferguson’s website.Forty-seven states, including Washington, have legislation on the books that requires companies or government entities to disclose whenever there’s been a breach of personally identifiable information. Under Washington law, companies are required to notify the Attorney General’s office if the incident affects more than 500 of the state’s residents. In this instance Boeing claims the information of 7,288 Washington residents may have been impacted.According to the letter, the breach occurred on Nov. 21, 2016 after a Boeing employee encountered a formatting issue and emailed a spreadsheet to his spouse who didn’t work at the company. The file contained sensitive, personally identifiable information of 36,000 of the aircraft manufacturer’s employees. The file included the names, places of birth, BEMSID, or employee ID numbers, and accounting department codes. The spreadsheet also included Social security numbers and dates of birth, albeit in “hidden columns,” according to Olson.Spreadsheet software, such as Microsoft’s Excel, usually allows authors to make select information hidden, usually to prevent that data from being seen, changed, or deleted.According to Olson’s letter, the breach was discovered earlier this year, on Jan. 9, but the company didn’t begin to inform employees until a month later, Feb. 8.In the letter to Ferguson, Boeing claims it destroyed copies of the spreadsheet and carried out a “forensic examination” of both the Boeing employee’s computer and his spouse’s to ensure it was deleted.\"More information: https://threatpost.com/boeing-notifies-36000-employees-following-breach/...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2017, "Latitude": 47.60621, "Longitude": -122.332071}