{"Date Made Public": "2017-02-28", "date": "2017-02-28", "Company": "Emory Healthcare", "City": "Atlanta", "State": "Georgia", "Type of breach": "HACK", "Type of organization": "MED", "Total Records": 80000, "Description of incident": "\"An attack on a database used by Emory Healthcare for patient appointments is the largest health data breach reported to federal regulators so far in 2017. The incident, which exposed data on almost 80,000 individuals, seems to spotlight a persistent problem facing a growing number of organizations that use misconfigured MongoDB and other similar databases, security exerts say (see Database Hijackings: Who's Next?).In a statement posted on its website, Atlanta, Ga.-based Emory Healthcare says that on Jan. 3, the organization \"learned that there was unauthorized access to [its patient appointment] waits & delays database around the New Year's weekend after someone deleted the database and demanded that EHC pay to have it restored.\"In addition to the extortion attack on the database, Emory Healthcare says in its notification statement that it also learned \"that there was another unauthorized access by an independent security research center that searches out vulnerabilities in applications and traditionally notifies the company so that it can be remedied.\"The unnamed independent security research firm referenced by Emory in its statement is believed to be MacKeeper Security Research Center. That's because Mackeeper wrote in a Jan. 4 blog that on Dec. 30, its security researchers discovered a misconfigured Mongo database that \"contained hundreds of thousands of what appeared to be patient records and other sensitive information,\" belonging to Emory Healthcare. \"The IP was hosted on Google Cloud and results for domain names hosted on that address (Reverse IP) identified Emory Brain Health Center,\" MacKeeper wrote.\"More Information: http://www.databreachtoday.com/emory-healthcare-database-breach-what-hap...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2017, "Latitude": 33.748995, "Longitude": -84.387982}