{"Date Made Public": "2017-03-15", "date": "2017-03-15", "Company": "Wishbone", "City": "Santa Monica", "State": "California", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"Check your kid’s phone for this app, ASAP: Wishbone. This popular quiz app for kids, tweens and teens has been hacked, according to a report from Motherboard out this morning. The hack involved 2.2 million email addresses, as well as 287,000 phone numbers, many of which are from kids under the age of 18.The app is operated by the incubator Science, and is one of the more popular social networking applications in the U.S., currently ranking No. 14 in that category on iTunes.Users have been alerted to the hack by way of an email from the company, which explains that it became aware of the breach on March 14, 2017.Per the email, hackers appear to have accessed a private API to pull information on Wishbone users. This included usernames, personal names, emails and phone numbers. Some users also opted to provide their date of birth to Wishbone, and, if they did, this information was also included. Wishbone says no passwords or financial information was part of the breach, however.Users were also alerted via an in-app notification.The message says that Wishbone is initiating “precautionary measures” as a part of the breach. But Motherboard received confirmation that the vulnerability has now been fixed.Unfortunately, the data is already out there in the wild, and consists mainly of kids’ personal information. The app’s core demographic is very young users — many who don’t even yet have iPhones, but play with the app on their iPod touch. Thankfully, this limited the amount of phone numbers included in the data breach.\"More Information: https://techcrunch.com/2017/03/15/teen-quiz-app-wishbone-hacked-users-em...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2017, "Latitude": 34.014684, "Longitude": -118.496812}