{"Date Made Public": "2017-03-16", "date": "2017-03-16", "Company": "Summit Reinsurances Services", "City": "Fort Wayne", "State": "Indiana", "Type of breach": "HACK", "Type of organization": "MED", "Total Records": 0, "Description of incident": "\"On August 8, 2016, Summit Reinsurance Services, Inc. became aware of a ransomware attack on a server containing patient PHI. The organization immediately initiated an investigation into the incident and concluded an unauthorized user accessed the server around March 13, 2016.  The investigation also found the information on the affected server may have included Social Security numbers, health insurance information, provider names, and claim-focused medical records containing diagnoses and clinical information.Summit did not state how many patients were potentially impacted by the security breach but it asserted there is no evidence any information from the affected server has been misused in any way.To mitigate any further problems, Summit has informed potentially impacted individuals of the incident and provided information to help concerned patients protect themselves against identity theft and fraud in the future. The organization has also provided individuals with one free year of credit monitoring and identity restoration.This incident was the catalyst for numerous reported security issues that were reported throughout 2016 at several healthcare organizations. For example, Black Hawk College reported in 2016 that certain information may have been accessed through an infected server containing PHI.Summit has worked to notify all impacted individuals and healthcare organizations of each incident and provided information for those seeking assistance in finding ways to protect their information moving forward.\"More Information:  http://healthitsecurity.com/news/va-university-health-system-security-br...", "Information Source": "Media", "Source URL": "", "Year of Breach": 2017, "Latitude": 41.079273, "Longitude": -85.139351}