{"Date Made Public": "2017-05-26", "date": "2017-05-26", "Company": "The Arizona Department of Health Services", "City": "Phoenix", "State": "Arizona", "Type of breach": "PHYS", "Type of organization": "MED", "Total Records": 2500, "Description of incident": "\"State health officials have warned 2,500 individuals and families with newborns that a box containing sensitive health, financial and personal information has been lost in the mail. The Arizona Department of Health Services saidits newborn-screening program gathered the information for billing purposes.The misplaced records may include health information for children tested in the program and their mothers, as well as their addresses, birth dates, health-insurance records, names, phone numbers and Social Security numbers. ADHS said families whose records are affected will be mailed notices of the possible data breach. The state said those families should monitor for fraud alerts that signal improper use of their personal information.State officials added that there's no evidence that unauthorized people have accessed the records — they just don't know where the records currently are located.On April 20, two parcels holding billing records that contained \"protected health information\" were mailed to the state's billing contractor, Midwest Medical Practice Management of Carbondale, Illinois. The records were mailed to allow the out-of-state vendor to bill for newborn-screening services performed by ADHS.Both parcels were sent via the U.S. Postal Service, but only one arrived. According to a statement released by ADHS, a tracking website showed the parcel reached a Postal Service facility in Phoenix on the night of April 20. Two days later, the tracking website indicated that the parcel was \"(i)n (t)ransit to (d)estination\" — a status that hasn't changed since April 22.\" ", "Information Source": "Media", "Source URL": "http://www.azcentral.com/story/news/local/arizona/2017/05/27/department-health-data-breach-newborn-screening/350682001/", "Year of Breach": 2017, "Latitude": 33.449974, "Longitude": -112.099034}