{"Date Made Public": "2017-06-05", "date": "2017-06-05", "Company": "Dr. Zain Kadri", "City": "Beverly Hills", "State": "California", "Type of breach": "INSD", "Type of organization": "MED", "Total Records": 15000, "Description of incident": "\"The theft of confidential files from a prominent Beverly Hills surgeon could affect the privacy and financial security of as many as 15,000 patients, according to a spokesman for the doctor and law enforcement officials.A statement issued by Dr. Zain Kadri’s office said a former staff member “stole credit card information, debit card information, IDs, copies of checks, usernames, passwords” and photographed patients before and during surgery. A spokesman for Kadri’s office, who declined to be identified, said the theft might affect patients in at least 17 states and seven countries outside the United States.“Despite having only recently being discovered, the breach, which affects thousands of patients, started shortly after the ... staffer was hired in September of 2016,” the statement read.A Palmdale residence belonging to Kadri was also burglarized May 5, according to a statement issued Thursday by the Los Angeles County Sheriff’s Department. Patient files, medical supplies and electronic devices were stolen, authorities said. Kadri’s spokesman described the residence as an “administrative office” the surgeon uses when performing procedures in a Palmdale office.“Nobody knows it’s there except for us. It’s our registered address for all business documents,” the spokesman said.Though Kadri said in the statement that he believes the break-in was carried out by the same employee, the Sheriff’s Department said there were no witnesses. Investigators want to question the ex-employee, who has not yet been detained, according to the department statement.Calls to the Palmdale Sheriff’s Station on Friday seeking additional comment were not immediately returned.Kadri’s office also learned recently that an Instagram account was created to host what are believed to be illegal recordings of patients during surgery. The account, which contains videos of procedures and pictures of patients, published its earliest post in January.“These patients did not approve this,” the spokesman said. “We did not approve this.”The employee was hired as a driver for Kadri in September 2016, and over time she began to take on additional duties. She quit in March of this year after Kadri and his staff accused her of embezzling from the company, the spokesman said.\"", "Information Source": "Media", "Source URL": "http://enewspaper.latimes.com/infinity/article_popover_share.aspx?guid=0511a587-c9aa-4ea2-a331-64f54856baeb", "Year of Breach": 2017, "Latitude": 34.07362, "Longitude": -118.400356}