{"Date Made Public": "2017-07-31", "date": "2017-07-31", "Company": "Wells Fargo", "City": "San Francisco", "State": "California", "Type of breach": "DISC", "Type of organization": "BSF", "Total Records": 50000, "Description of incident": "\"When a lawyer for Gary Sinderbrand, a former Wells Fargo employee, subpoenaed the bank as part of a defamation lawsuit against a bank employee, he and Mr. Sinderbrand expected to receive a selection of emails and documents related to the case.But what landed in Mr. Sinderbrand’s hands on July 8 went far beyond what his lawyer had asked for: Wells Fargo had turned over — by accident, according to the bank’s lawyer — a vast trove of confidential information about tens of thousands of the bank’s wealthiest clients.The 1.4 gigabytes of files that Wells Fargo’s lawyer sent included copious spreadsheets with customers’ names and Social Security numbers, paired with financial details like the size of their investment portfolios and the fees the bank charged them. Most are customers of Wells Fargo Advisors, the arm of the bank that caters to high-net-worth investors.By Mr. Sinderbrand’s estimate, he has financial information for at least 50,000 individual customers. In all, Mr. Sinderbrand said, these clients have tens of billions of dollars invested through Wells Fargo, all laid out in vivid detail for him as part of the discovery process in his lawsuit.The files were handed over to Mr. Sinderbrand with no protective orders and no written confidentiality agreement in place between his lawyers and Wells Fargo’s. While the documents were not filed in court, it would be perfectly legal for Mr. Sinderbrand and his lawyer to release most of the material or include it in their legal filings, which would then become part of the public record.The documents were sent by Angela A. Turiano, a lawyer with Bressler, Amery & Ross, an outside law firm in Florham Park, N.J., hired by Wells Fargo, which is not a party to the suit. Mr. Sinderbrand and one of his lawyers, Aaron Zeisler, notified Ms. Turiano on Thursday morning about the sensitive documents now in their hands.\" ", "Information Source": "Media", "Source URL": "https://www.nytimes.com/2017/07/21/business/dealbook/wells-fargo-confidential-data-release.html", "Year of Breach": 2017, "Latitude": 37.793377, "Longitude": -122.40262}