{"Date Made Public": "2017-02-17", "date": "2017-02-17", "Company": "Deboer Income Tax", "City": "Big Bear Lake", "State": "California", "Type of breach": "HACK", "Type of organization": "BSF", "Total Records": 7, "Description of incident": "\"We are notifying you that our data system may have been breached.  We have  observed an increased rate of e-file tax returns being rejected by the IRS due to the client's social security number having been already submitted in another tax return.   Normally we may have one or two of our clients experience this identify theft problem during a tax season and this year we have already experienced seven of these rejections.  We take the privacy of our clients very serious and after observing this we have been working closely with the IRS and partners and have taken the following steps:  *  Our data security team, Computer Reality, has investigated the breach and uncovered a series of attacks trying to gain access to our systems.  The investigation produced a series of IP addresses that had been attacking our system, but the investigation could not ascertain weather they gained successful access and/or what records were exposed.    *  As a security measure all of our computer systems has been reconfigured from the bottom up with a new IP address and new ID's and Passwords.  *  Shared Investigation findings with IRS partner.  For clients that are effected by an identity theft issue.  We are working with the IRS and are will be submitting mail in tax returns with an attached affidavit confirming your identify.   The effect will be that for those effected there refund will be delayed as the IRS is going through extra scrutiny to protect your identy and ensure you get your proper refund.\"More information: https://oag.ca.gov/ecrime/databreach/reports/sb24-66415https://oag.ca.go...", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 34.243896, "Longitude": -116.911422}