{"Date Made Public": "2018-04-20", "date": "2018-04-20", "Company": "UnityPoint Health", "City": "West Des Moines", "State": "Iowa", "Type of breach": "HACK", "Type of organization": "MED", "Total Records": 16000, "Description of incident": "UnityPoint Health confirmed that its dealing with an information breach that impacted patients. \"After a detailed forensic investigation and document review, UnityPoint Health determined that protected health information was contained in impacted email accounts, including patient names and one or more of the following: dates of birth, medical record numbers, treatment information, surgical information, diagnoses, lab results, medications, providers, dates of service and/or insurance information. For a limited number of impacted individuals, information that may have been viewed included Social Security Numbers or other financial information.\" They said they are not aware of any fraud issues at this point, but they still want the people impacted to be aware of the problem. They are advising people to follow these steps:  Only share your health insurance cards with your health care providers and other family members who are covered under your insurance plan or who help you with your medical care.Review your “explanation of benefits statement” which you receive from your health insurance company. Follow up with your insurance company or care provider for any items you do not recognize. If necessary, contact the care provider on the explanation of benefits statement and ask for copies of medical records from the date of the potential access (noted above) to current date. Ask your insurance company for a current year-to-date report of all services paid for you as a beneficiary. Follow up with your insurance company or the care provider for any items you do not recognize.The hospital has apologized to patients for this problem. If you want to learn if your information was compromised or you have questions, call 855-331-3612.", "Information Source": "Media", "Source URL": "http://www.wkow.com/story/38002617/2018/04/20/unitypoint-health-affected-by-data-breach", "Year of Breach": 2018, "Latitude": 41.577212, "Longitude": -93.711332}