{"Date Made Public": "2018-05-20", "date": "2018-05-20", "Company": "TeenSafe", "City": "Los Angeles", "State": "California", "Type of breach": "DISC", "Type of organization": "BSR", "Total Records": 10200, "Description of incident": "ZDNet's Zack Whittaker reports:At least one server used by an app for parents to monitor their teenagers' phone activity has leaked tens of thousands of accounts of both parents and children.The mobile app, TeenSafe, bills itself as a \"secure\" monitoring app for iOS and Android, which lets parents view their child's text messages and location, monitor who they're calling and when, access their web browsing history, and find out which apps they have installed.Although teen monitoring apps are controversial and privacy-invasive, the company says it doesn't require parents to obtain the consent of their children.But the Los Angeles, Calif.-based company left its servers, hosted on Amazon's cloud, unprotected and accessible by anyone without a password.. . . .The database stores the parent's email address associated with TeenSafe, as well as their corresponding child's Apple ID email address. It also includes the child's device name -- which is often just their name -- and their device's unique identifier. The data contains the plaintext passwords for the child's Apple ID. Because the app requires that two-factor authentication is turned off, a malicious actor viewing this data only needs to use the credentials to break into the child's account to access their personal content data.None of the records contained content data, such as photos or messages, or the locations of either parents or children.The data also contained error messages associated with a failed account action, such as if a parent looking up a child's real-time location didn't complete.Shortly before the server went offline, there were at least 10,200 records from the past three months containing customers data -- but some are duplicates.TeenSafe claims to have over a million parents using the service.   ", "Information Source": "Media", "Source URL": "https://www.zdnet.com/article/teen-phone-monitoring-app-leaks-thousands-of-users-data/", "Year of Breach": 2018, "Latitude": 34.052234, "Longitude": -118.243685}