{"Date Made Public": "2018-06-22", "date": "2018-06-22", "Company": "PDQ Restuarants", "City": "Tampa", "State": "Florida", "Type of breach": "HACK", "Type of organization": "BSR", "Total Records": 0, "Description of incident": "According to PDQ, \"We have been the target of a cyber-attack.  An unauthorized person (hacker) exploited part of our computer related system and accessed and or acquired personal information from some of our customers. We believe the attacker gained entry through an outside technology vendor’s remote connection tool. Based on an investigation, the unauthorized access and or acquisition occurred from May 19, 2017 – April 20, 2018 (breach time period). We learned on June 8, 2018 that credit card information and or some names may have been hacked.All PDQ locations in operation during some or all of the breach time period, May 19, 2017 – April 20, 2018, were affected. However, the following locations were not affected: Tampa International Airport location at 4100 George J Bean Pkwy, Tampa, FL 33607, Amalie Arena location at 401 Channelside Drive, Tampa, FL 33602, and PNC Arena location at 1400 Edwards Mill Road, Raleigh, NC 27607The information accessed and or acquired included some or all of the following: names, credit card numbers, expiration dates, and cardholder verification value. However, it should be noted that the cardholder verification value that may have been accessed or acquired is not the same as the security code printed on the back of certain payment cards (e.g., Discover, MasterCard, and Visa) or printed on the front of other payment cards (e.g., American Express). Based on the nature of the breach, it was not possible to determine the identity or exact number of credit card numbers or names that were accessed or acquired during the breach time period.", "Information Source": "Media", "Source URL": "https://www.eatpdq.com/promos/news/2018/06/22/guestinfo", "Year of Breach": 2018, "Latitude": 27.950575, "Longitude": -82.457178}