{"Date Made Public": "2018-07-03", "date": "2018-07-03", "Company": "Exactis", "City": "Palm Coast", "State": "Florida", "Type of breach": "DISC", "Type of organization": "BSO", "Total Records": 340000000, "Description of incident": "According to Wired, \"Exactis, a data broker based in Palm Coast, Florida, had exposed a database that contained close to 340 million individual records on a publicly accessible server. The haul comprises close to 2 terabytes of data that appears to include personal information on hundreds of millions of American adults, as well as millions of businesses. While the precise number of individuals included in the data isn't clear—and the leak doesn't seem to contain credit card information or Social Security numbers—it does go into minute detail for each individual listed, including phone numbers, home addresses, email addresses, and other highly personal characteristics for every name. The categories range from interests and habits to the number, age, and gender of the person's children.\"It seems like this is a database with pretty much every US citizen in it,\" says Troia, who is the founder of his own New York-based security company, Night Lion Security. Troia notes that almost every person he's searched for in the database, he's found. And when WIRED asked him to find records for a list of 10 specific people in the database, he very quickly found six of them. \"I don’t know where the data is coming from, but it’s one of the most comprehensive collections I’ve ever seen,\" he says.\"Aside from the sheer breadth of the Exactis leak, it may be even more remarkable for its depth: Each record contains entries that go far beyond contact information and public records to include more than 400 variables on a vast range of specific characteristics: whether the person smokes, their religion, whether they have dogs or cats, and interests as varied as scuba diving and plus-size apparel. WIRED independently analyzed a sample of the data Troia shared and confirmed its authenticity, though in some cases the information is outdated or inaccurate.\" ", "Information Source": "Media", "Source URL": "https://www.wired.com/story/exactis-database-leak-340-million-records/", "Year of Breach": 2018, "Latitude": 29.584452, "Longitude": -81.20787}