{"Date Made Public": "2017-02-22", "date": "2017-02-22", "Company": "JoFit", "City": "Warminster", "State": "Pennsylvania", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"We’re writing to inform you about a data security incident that may have exposed some of your personal information. For this reason, we are contacting you directly to explain the circumstances of the incident and the outcome of our investigation. What happened? In mid-January, JoFit first learned that its website may have been the target of a cybersecurity attack aimed at acquiring customer credit card information. On the same day that we received this information, JoFit began work to investigate and take any necessary corrective steps. In that process, we confirmed that there was a vulnerability in the website that could have resulting in exposure of personal information. Within days of first learning of the incident, we notified law enforcement of this incident, and we hired an independent computer forensics consultant that specializes in cybersecurity. The consultant is investigating precisely what happened, what information may have been compromised, and what additional steps are needed. What information was involved? The information that may have been compromised included first name, last name, and credit card payment information. What we are doing. JoFit is continuing its investigation of the situation. In the meantime, while our investigation is ongoing, we have engaged Epiq Corporate Services, Inc. (“EPIQ”) to provide identity monitoring at no cost to you for one year. Please review the enclosed “EPIQ Family Secure” section included with this letter for information on how to activate your complimentary identity monitoring services.\"More information: https://oag.ca.gov/ecrime/databreach/reports/sb24-66446", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 40.21315, "Longitude": -75.083485}