{"Date Made Public": "2018-10-08", "date": "2018-10-08", "Company": "Alphabet, Inc. - Google+", "City": "", "State": "California", "Type of breach": "DISC", "Type of organization": "BSR", "Total Records": 500000, "Description of incident": "According to a press release, Alphabet Inc. is shutting down the social network Google+ following discovery of a bug affecting the profiles of nearly 500,000 users.Underlining this, as part of our Project Strobe audit, we discovered a bug in one of the Google+ People APIs:Users can grant access to their Profile data, and the public Profile information of their friends, to Google+ apps, via the API.The bug meant that apps also had access to Profile fields that were shared with the user, but not marked as public.  This data is limited to static, optional Google+ Profile fields including name, email address, occupation, gender and age. (See the full list on our developer site.) It does not include any other data you may have posted or connected to Google+ or any other service, like Google+ posts, messages, Google account data, phone numbers or G Suite content.We discovered and immediately patched this bug in March 2018. We believe it occurred after launch as a result of the API’s interaction with a subsequent Google+ code change.We made Google+ with privacy in mind and therefore keep this API’s log data for only two weeks. That means we cannot confirm which users were impacted by this bug. However, we ran a detailed analysis over the two weeks prior to patching the bug, and from that analysis, the Profiles of up to 500,000 Google+ accounts were potentially affected. Our analysis showed that up to 438 applications may have used this API.We found no evidence that any developer was aware of this bug, or abusing the API, and we found no evidence that any Profile data was misused.", "Information Source": "Media", "Source URL": "https://www.blog.google/technology/safety-security/project-strobe/", "Year of Breach": 2018, "Latitude": 0.0, "Longitude": 0.0}