{"Date Made Public": "2017-02-24", "date": "2017-02-24", "Company": "Abbott Nutrition", "City": "Columbus", "State": "Ohio", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"We wanted to notify you of an unauthorized intrusion which resulted in the compromise of some customer information at AbbottStore.com.  The privacy and protection of our customers' information is a matter we take very seriously, and we have worked swiftly to resolve the incident.  We recommend that you closely review the information provided in this letter for some steps that you may take to protect yourself against potential misuse of your information.\" What Happened?On February 6, 2017, we were first alerted of a security incident at Aptos, Inc. (Aptos), the company that provided and managed the e-commerce platform for AbbottStore.com.  This incident may affect our customers who purchase products from AbbottStore.com.  Aptos retained the services of an outside security forensics team to investigate the nature and scope of the incident.What Information Was Involved?Aptos' investigation determined that an unauthorized party entered Aptos' systems and was able to access and possibly obtain the following information for customers who purchased products from AbbottStore.com from approximately June 2013 to December 2016: names, addresses, phone numbers, e-mail addresses, payment card numbers, and expiration dates.Additionally, for customers who placed an order on AbbottStore.com between approximately April 11 and August 8, 2016 and between approximately November 12 and November 28, 2016, the information compromised may also have included card security codes (CVV numbers). Individual who visited AbbottStore.com but did not make a purchase online or by phone are not affected.\"More information: https://oag.ca.gov/ecrime/databreach/reports/sb24-66497    ", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 40.039977, "Longitude": -82.906337}