{"Date Made Public": "2017-03-01", "date": "2017-03-01", "Company": "Stallcup & Associates CPA's", "City": "San Francisco", "State": "California", "Type of breach": "HACK", "Type of organization": "BSF", "Total Records": 0, "Description of incident": "\"On January 10, 2017, we became aware that some clients had received an email from our office that we did not send.  Upon discovery of this fraudulent activity, we sent an email alerting you not to open the email.  We also immediately contacted our local IT consultant, re-secured the email account michelle@stallcupcpas.com, and promptly hired forensic IT specialists to determine exactly what happened and what information and systems were affected.  The forensic investigation is now completed and the unauthorized access has been determined to be limited to the one email account. While there is no evidence of data viewing or exfiltration of information, the fraudulent person(s) did obtain the employee’s email credentials and therefore had access to her email account.  What Information Was Involved?  I am notifying you of this incident because you exchanged email correspondences on the following email account michelle@stallcupcpas.com and therefore, that information could have been accessed by the perpetrator(s).  Given the nature of our relationship, this information included your name, email address, physical address, social security number, and could include any of the following: • W-2 and/or 1099-MISC information such as employer/payer name and address, and amount of compensation and annual gross income and tax • Brokerage account number and amounts received as investment income, including gross proceeds and cost basis information • Amounts of gross income and tax (Electronic Filing Authorization form) • Form K-1 • IRA information • Federal and state tax return • IRS or state agency notices • Date of birth\"More Information: https://oag.ca.gov/ecrime/databreach/reports/sb24-66627", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 37.755626, "Longitude": -122.418512}