{"Date Made Public": "2017-03-13", "date": "2017-03-13", "Company": "Ondracek & Company", "City": "Santa Barbara", "State": "California", "Type of breach": "HACK", "Type of organization": "BSF", "Total Records": 0, "Description of incident": "\"What Happened?On February 6, 2017, we learned that some clients had received notification letters from the IRS telling them that someone had filed or attempted to file a  2016 tax return.   Knowing that neither they nor we filed the returns, we immediately began an investigation into the matter (specifically, whether the breach was from a third party or our network).  That same day we contacted our IT consultant, immediately changed all system passwords and user information, and started running scans and reviewing our systems to identify any malicious malware on our network.  None was found.  We further contacted the IRS and FTB, and hired a specialized forensic IT firm for additional investigation.On February 17, 2017, the specialized forensic IT firm determined that hackers had gained unauthorized access to our system from a foreign IP address.  Immediately upon discovery, we notified you of the unauthorized access to your information via email, as a precursor to this letter.  Through investigation we have discovered that the unauthorized access occurred through Remote Desktop Protocol between November 21, 2016 and February6, 2017.What Information Was Involved?If you are an individual, this information may have included your: name, date of birth, telephone number(s), address, Social Security number, all employment (W-2) information, 1099 information (including account number if  provided to me), and direct deposit bank account information (including account number and routing information if provided to me). If you are an entity, this information may have included your: company name, Federal Employer Identification Number, address, telephone number; employee and/or 1099-recipient information (including account number if provided to me); bank or brokerage account information if provided to me; and partner,shareholder/officer or beneficiary names, addresses, and Social Security numbers.\"", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 34.420831, "Longitude": -119.69819}