{"Date Made Public": "2011-07-07", "date": "2011-07-07", "Company": "Troy Regional Medical Center (TRMC), Southern Records Management Inc.", "City": "Troy", "State": "Alabama", "Type of breach": "INSD", "Type of organization": "MED", "Total Records": 880, "Description of incident": "TRMC discovered that someone had removed paper records that contained the information of approximately 880 patients.  The unauthorized access and removal happened in early 2011 and was reported to TRMC by law enforcement on May 20, 2011. Affected patients had their names, Social Security numbers, addresses, dates of birth and medical record numbers exposed.  It appears that some of the personal information was used to file fraudulent income tax returns with the IRS.UPDATE (06/13/2012): A woman was arrested on felony charges for allegedly conspiring with others to steal the information of 880 patients while she worked with Southern Records Management at TRMC.  The 22-count felony indictment includes allegations of fraud against the U.S. government as part of a tax fraud scheme.  UPDATE (10/26/2012): A former Southern Records Management employee working for Troy between June 13, 2010 and March 25, 2011 pled guilty to one count of conspiring to defraud the government regarding claims, one count of fraud in connection with identification documents, a count of fraud in connection with computers, and a count of aggravated identity theft.UPDATE (02/07/2013): The dishonest employee was sentenced to 65 months in prison.UPDATE (05/24/2013): A second co-conspirator pleaded guilty to the theft of government money, fraudulent use of debit cards, and aggravated identity theft.  She received 10 years in prison.  A total sum of $1,198,063 was fraudulently obtained through fake tax refunds.UPDATE (06/13/2013): Another conspirator was convicted of ID theft and tax fraud after pleading guilty to theft of government money, fraudulent use of debit cards, and aggravated identity theft.  The court ordered a 10-year prison sentence for the conspirator.", "Information Source": "PHIPrivacy.net", "Source URL": "", "Year of Breach": 2011, "Latitude": 31.808768, "Longitude": -85.969951}