{"Date Made Public": "2017-03-21", "date": "2017-03-21", "Company": "LYFE Kitchen Notice of Data Breach", "City": "Memphis", "State": "Tennessee", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"What Happened? LYFE  Kitchen  was  notified  by  its  third-party  point  of  sale  (“POS”)  vendor  that  the  vendor’s  computer network potentially had been compromised by a malware data breach.  The malware was programmed to access data from the magnetic stripe of payment cards at the time they were swiped.  The magnetic stripe contains only the card number, expiration date and verification code.  No other customer information was involved. Based on our third-party IT  security  expert’s  investigation,  the  malware  could  have  affected  the  POS  equipment  at  two  (2)  LYFE  Kitchen corporate  restaurants  in  California,  two  (2)  corporate  restaurants  in  Tennessee,  and  one  (1)  corporate  restaurant  in Nevada  (listed  below).  The  malware  has  been  removed  and  eradicated.    We  have  no  evidence  that  the  malware exported any payment card information to the malware host, and we have received no reports of unauthorized charges from customers or the banks that issued payment cards.  II.What Information Was Involved? LYFE Kitchen does not have customers’ social security numbers, driver’s license numbers, or other personal information. Additionally, we do not store customers’ payment card information.  But this incident may have resulted in  the  unauthorized  acquisition  of  payment  card  information  of  some  LYFE  Kitchen  customers  who  dined  on  the dates and at the locations listed below:  • November  3,  2016  to  January  5,  2017:  LYFE  Kitchen,  12746  Jefferson  Blvd.,  Suite  2200,  Los Angeles, CA 90094. • November 3, 2016 to January 6, 2017: LYFE Kitchen, Valencia Town Center, 24201 Valencia Blvd., Ste. 3260, Valencia, CA 91355.  • November 2, 2016 to January 3, 2017: LYFE Kitchen, 272 S. Main St., Memphis, TN 38103.   • November 3, 2016 to January 5, 2017: LYFE Kitchen, 6201 Poplar Ave., Memphis, TN 38119. • November 3, 2016 to January 5, 2017: LYFE Kitchen, 140 S. Green Valley Pkwy., Henderson, NV 89102.\"More Information: https://oag.ca.gov/ecrime/databreach/reports/sb24-67060", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 35.149534, "Longitude": -90.04898}