{"Date Made Public": "2017-03-29", "date": "2017-03-29", "Company": "Oilandgasjobsearch.com", "City": "", "State": "Cheshire", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"At Oilandgasjobsearch.com, our candidates and our employers are our top priority.  We are writing to you today to inform you of an incident in which we experienced unauthorized access to data within our systems.  Oilandgasjobsearch.com, an independent UK subsidiary of CareerBuilder, investigated the incident with a leading IT security firm and law enforcement to understand all of the facts.  Based on our investigation, we believe that your candidate account credentials (user name and password) and your CV (or resume) may have been accessed by an unauthorized third party.  Our investigation has revealed that the unauthorized third party accessed Oilandgasjobsearch.com systems beginning in September of 2016.We have implemented additional security measures for Oilandgasjobsearch.com systems.  We are resetting all candidate account passwords to secure access to each account.  In order to obtain access to your account you will need to create a new password by going to Oilandgasjobsearch.com and clicking “Forgotten your password?” in the Login tab.  You will then be prompted to enter your email address and click “Recover Your Password” and you will receive an email from Oilandgasjobsearch.com that will contain a time-sensitive link.  Please click on the link within 24 hours after receiving it and follow the prompts that instruct you to reset your account password.  We encourage you to use a “strong” password that is different from your previous Oilandgasjobsearch.com password.  Strong passwords tend to be long and include a mix of letters, numbers and characters.  We also recommend that you change your password for any other online accounts that use a similar user name or email address and password combination.\"More Information:    https://oag.ca.gov/ecrime/databreach/reports/sb24-67192", "Information Source": "California Attorney General", "Source URL": "", "Year of Breach": 2017, "Latitude": 53.438197, "Longitude": -2.165726}