{"Date Made Public": "2012-02-15", "date": "2012-02-15", "Company": "St. Joseph Health System", "City": "Irvine", "State": "California", "Type of breach": "DISC", "Type of organization": "MED", "Total Records": 31800, "Description of incident": "Protected patient information may have been available on the internet for one year.  A patient's attorney contacted St. Jude officials to inform them that the information was available online. The patient health records included names, body mass index, blood pressure, lab results, smoking status, diagnoses lists, medication allergies, and demographic information such as gender, date of birth, language spoken, ethnicity, and race.  The information was removed from online and co no longer be accessed by unauthorized parties.  A total of 6,235 patients from Santa Rosa Memorial Hospital, two from Petaluma Valley Hospital, 4,263 from Queen of the Valley in Napa, and an unknown number of patients from St. Jude Medical Center in Fullerton, and Mission Hospitals in Laguna Beach and Mission Viejo were affected.UPDATE (07/10/2012): The California Department of Public Health was still investigating Queen of the Valley Medical Center as of July 10, 2012.  Additionally, two patients who were treated at Santa Rosa Memorial Hospital, filed a class action lawsuit on behalf of the 31,800 patients who were affected.  They seek $31.8 million, or $1,000 per patient.UPDATE (10/18/2016): \"St. Joseph Health (SJH) has agreed to settle potential violations of the Health Insurance Portability and Accountability Act of 1996 (HIPAA) Privacy and Security Rules following the report that files containing electronic protected health information (ePHI) were publicly accessible through internet search engines from 2011 until 2012. SJH, a nonprofit integrated Catholic health care delivery system sponsored by the St. Joseph Health Ministry, will pay a settlement amount of $2,140,500 and adopt a comprehensive corrective action plan. SJH’s range of services includes 14 acute care hospitals, home health agencies, hospice care, outpatient services, skilled nursing facilities, community clinics and physician organizations throughout California and in parts of Texas and New Mexico.\"More Information: http://www.hhs.gov/about/news/2016/10/18/214-million-hipaa-settlement-un...", "Information Source": "PHIPrivacy.net", "Source URL": "", "Year of Breach": 2012, "Latitude": 33.683947, "Longitude": -117.794694}