{"Date Made Public": "2012-04-11", "date": "2012-04-11", "Company": "North Shore University Hospital, North Shore - Long Island Jewish Health System", "City": "Manhasset", "State": "New York", "Type of breach": "UNKN", "Type of organization": "MED", "Total Records": 950, "Description of incident": "A licensed nurse who may or may not have been affiliated with North Shore University Hospital was indicted for identity theft and possessing computer data from North Shore containing information on over 900 people.  It is unclear when the breach that allowed the nurse and an accomplice to access the information first occurred.  Social Security numbers, dates of birth, addresses, phone numbers, medical record numbers, insurance information, and medical histories could have been accessed.  North Shore University Hospital notified 50 patients of a potential breach in 2011 and may have experienced a separate system breach in early January of 2012.  UPDATE (04/12/2012): The nurse also had the information of an unspecified number of U.S. Nippon Express employees.UPDATE (02/05/2013): A lawsuit has been filed by a group of people who claim that the breach allowed identity thieves to access and misuse their information.  Many, but not all, of twelve people who filed the lawsuit claim to have been victims of identity thieves. UPDATE (03/04/2013): North Shore Long Island Jewish Health System faces a $50 million class action lawsuit.  It was also revealed that thefts of patient face sheet information for identity theft purposes have occurred at least three times in a matter of just a few years.UPDATE (5/24/2014): Another North Shore Hospital employee was charged for her involvement in the identity theft ring. \"Latoya Talbert, 24, has been accused of stealing the identities so she  could go shopping. Talbert was arraigned in Nassau County for her  alleged involvement in an identity theft ring that began in 2011\".", "Information Source": "PHIPrivacy.net", "Source URL": "", "Year of Breach": 2012, "Latitude": 40.797879, "Longitude": -73.699575}