{"Date Made Public": "2017-04-17", "date": "2017-04-17", "Company": "Combat Brands", "City": "Lenexa", "State": "Kansas", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"We recently learned that we were the victims of a sophisticated cyber-attack that may affect the security of your payment information. We are providing you with information about the incident, steps we are taking in response, and steps you can take to protect against fraud should you feel it is appropriate.What Happened?On January 25, 2017, we began investigating some unusual activity reported by our credit card processor.  We immediately began to work with third-party forensic experts to investigate these reports and to identify any signs of compromise on our systems.  On February 23, 2017, we discovered that we were the victim of a sophisticated cyber-attack that resulted in the potential compromise of some customers’ debit and credit card data used at www.fightgear.com, www.fitness1st.com, www.ringside.com, and www.combatsports.com between July 1, 2015 and February 23, 2017. Since that time, we have been working with third-party forensic investigators to determine what happened, what information was affected and to implement additional procedures to further protect the security of customer debit and credit cards.  We removed the malware at issue to prevent any further unauthorized access to customer debit or credit card information.  We are also working with the Federal Bureau of Investigations to investigate this incident.  You can safely use your payment card at our websites.What Information Was Involved? Through the ongoing third-party forensic investigations, we confirmed on February 23, 2017 that malware may have stolen credit or debit card data from some credit and debit cards used at www.fightgear.com, www.fitness1st.com, www.ringside.com, and www.combatsports.com between July 1, 2015 and February 23, 2017. The information at risk as a result of this event includes the cardholder’s name, address, card number, expiration date and CVV.\"", "Information Source": "California Attorney General", "Source URL": "https://oag.ca.gov/ecrime/databreach/reports/sb24-67664", "Year of Breach": 2017, "Latitude": 38.933861, "Longitude": -94.769604}