{"Date Made Public": "2013-12-20", "date": "2013-12-20", "Company": "Washington Department of Social and Health Services (DSHS)", "City": "Tacoma", "State": "Washington", "Type of breach": "DISC", "Type of organization": "MED", "Total Records": 2600, "Description of incident": "The personal information of between 2,600 and 7,000 households receiving assistance from the Washington DSHS was accidentally mailed to old or incorrect addresses between August 19 and October 26.  The information included names, Social Security numbers, dates of birth, phone number and other contact information, medical diagnosis information, chemical dependency or treatment information, income, and any public-assistance services that the household received.  The issue was discovered on October 22.UPDATE: Acting Medicaid Director releases information on the incorrect mailing of Medicaid cards by NCDHHS: The Director states; \"After a review of the incident, it has been determined that some  Medicaid cards were incorrectly sent because of human error in computer  programming and the quality assurance process in printing the new  Medicaid identification cards.  These new cards were printed for  children switched from NC Health Choice to Medicaid because of new  eligibility rules and requirements under the Affordable Care Act  (Obamacare).  A program was developed to extract the information from  the eligibility database to generate the mailing, but utilized the  incorrect name and address for the parent or responsible adult. The incorrect card shows the child’s name, Medicaid identification  number, date of birth and primary care physician’s name and physician’s  address. No Social Security numbers were released. The parent or responsible adult who received an  incorrect card is being advised to immediately destroy it by shredding  or cutting it into small pieces. They are also being  advised that they can turn in the card to their county department of  social services if they prefer. A directory of the county social  services offices can be found here: http://www.ncdhhs.gov/dss/local/.\" (1-06-2014)", "Information Source": "PHIPrivacy.net", "Source URL": "", "Year of Breach": 2013, "Latitude": 47.252877, "Longitude": -122.444291}