{"Date Made Public": "2017-06-30", "date": "2017-06-30", "Company": "Meepos & Company CPA's", "City": "Marina Del Rey", "State": "California", "Type of breach": "HACK", "Type of organization": "BSF", "Total Records": 0, "Description of incident": "\"What Happened? On May 19, 2017, Meepos & Company (“Meepos”) received reports of issues with certain clients’ 2016 tax filings.  Meepos immediately launched an investigation and has been working diligently, with the assistance of third party forensic investigators, to determine what caused the issues and whether other clients may be affected.  Through the investigation, Meepos determined that an unauthorized actor or actors gained access to certain parts of Meepos’s network due to a misconfiguration of our two-factor password authentication and, as a result, may have had access to personal information for certain Meepos clients in our tax filing system, including documents that may be associated with our business client tax filings.  After discovering the unauthorized access, we immediately worked with our IT professionals to identify the access point, quarantined the affected system and completed enterprise wide password changes to better prevent further unauthorized access to our systems.  We also immediately contacted the IRS to alert them of the situation in order to stop the issuance of any fraudulent refunds.  The investigation has determined that the unauthorized actor(s) may have had access to Meepos’s system beginning on February 24, 2017, although the first known access to tax information and fraudulent filings did not occur until May 2017.What Information Was Involved? The information relating to you that was present on the affected systems would be located in documents attached to your business’ tax filings and may include the following categories of information: (1) name; (2) address; and (3) Social Security number or employer identification number.\"", "Information Source": "California Attorney General", "Source URL": "https://oag.ca.gov/system/files/Meepos%20-%20notice%20only_0.pdf", "Year of Breach": 2017, "Latitude": 33.980289, "Longitude": -118.451745}