{"Date Made Public": "2017-07-20", "date": "2017-07-20", "Company": "J. Palmer & Company", "City": "Visalia", "State": "California", "Type of breach": "HACK", "Type of organization": "BSF", "Total Records": 0, "Description of incident": "\"What happened?We discovered a cyberattack on our system on June 6th, 2017. Our forensic team was hired right away to conduct an investigation. This led us to believe cybercriminals attacked the remote-access system, used by our outside IT personnel, to    access our tax filing software around that time. This allowed the cybercriminals to access our system and files, including the use of what appears to be one staff’s credentials.  We then discovered that the cybercriminals used the information they obtained to attempt to file fictitious Federal tax returns to fraudulently receive refunds. Fortunately, we were able to inform and work with the Internal Revenue Service. Currently, only Federal tax returns were filed. Unfortunately, as we discussed, such fictitious tax returns were filed for you. What information was involved?We are notifying you of this incident because your personal identifying information was accessed or obtained by these cybercriminals. Given the nature of our relationship, this information may have included E-file authorization forms, copies of your tax returns, brokerage statements and real estate settlement statements. Documents could include your: full name, telephone number(s), address, Social Security Number, all employment W-2 information if applicable, 1099 information if applicable (which may include account number if provided), direct deposit bank account information (including account number and routing number if provided), email addresses (if provided to us), and supporting records.\"", "Information Source": "California Attorney General", "Source URL": "https://oag.ca.gov/ecrime/databreach/reports/sb24-100465", "Year of Breach": 2017, "Latitude": 36.296691, "Longitude": -119.28981}