{"Date Made Public": "2018-05-22", "date": "2018-05-22", "Company": "Muir Medical Group, IPA. Inc.", "City": "", "State": "California", "Type of breach": "PHYS", "Type of organization": "MED", "Total Records": 500, "Description of incident": "What happened? On March 7, 2018, Muir discovered that a former employee of Muir IPA took with her certain information in the possession of Muir IPA before her employment ended with Muir IPA in December 2017. . What information was involved? The information taken by Muir IPA’s former employee may have included your personal information, including demographic information (such as your name, address, email address, telephone number, date of birth, and Social Security number to the extent your Medicare number is derived from your Social Security number), insurance information (such as your health insurance plan name and health insurance identification number), and clinical information (such as your diagnoses, test results, medication information, and other treatment information in Muir IPA’s possession) ** Disclaimer ** The number of breached records reported reflects our best estimate, based on all the data currently available. Because the specific number of breached records was not disclosed in the notification letter sent to the California Attorney General’s Office, the number is estimated as the minimum number of breached records necessary to trigger the obligation to notify the Attorney General. Under Cal. Civ. Code §§ 1798.29, 1798.82, notification to the Attorney General is only required whenever a breach of records affects more than 500 California residents.If you are a business representative and believe this number is inaccurate, please contact us at chronology@privacyrights.org and we will review and update this record. ", "Information Source": "Security Breach Letter", "Source URL": "https://oag.ca.gov/system/files/Patient%20Notice%20Template%20%28002%29_0.PDF", "Year of Breach": 2017, "Latitude": 37.09024, "Longitude": -95.712891}