{"Date Made Public": "2017-05-11", "date": "2017-05-11", "Company": "Snake River Farms", "City": "Boise", "State": "Idaho", "Type of breach": "HACK", "Type of organization": "BSO", "Total Records": 0, "Description of incident": "\"Agri Beef Co. (“Agri Beef”) is writing to inform you of a data security incident that may have exposed some of your personally identifiable information (“PII”) submitted to our website snakeriverfarms.com (“Snake River Farms”). What Happened?Gorilla Group, a third-party partner that hosts Snake River Farms servers, advised us that a data security incident occurred during the window of November 22, 2016 to April 4, 2017, and Gorilla Group notified Agri Beef of the incident on April 5, 2017. During the window, a third party may have gained access to snakeriverfarms.com with the intent to obtain certain PII. The PII compromised includes: customer names, email addresses, billing addresses, telephone numbers, credit card/debit card numbers, credit card/debit card security codes and expiration dates, the credit card type, and the date of the transaction. After learning of the data breach on April 5, 2017, we have been working, with the aid of outside resources, to help you avoid and/or minimize as much as possible, any negative consequences. Our notification has not been delayed as a result of any law enforcement investigation. What Information Was Involved?The potentially compromised information relates to your transactions on the Snake River Farms website. As explained above, PII that may have been compromised includes: customer names, email addresses, billing addresses, telephone numbers, credit card/debit card numbers, credit card/debit card security codes and expiration dates, the credit card type, and the date of the transaction. Compromised information could be usedto attempt to fraudulently charge your credit or debit card.\"", "Information Source": "Vermont Attorney General", "Source URL": "http://ago.vermont.gov/assets/files/Consumer/Security_Breach/Dorsey%20&%20Whitney%20LLP%20SNB%20to%20Consumers.pdf", "Year of Breach": 2017, "Latitude": 43.615804, "Longitude": -116.220692}