{"Date Made Public": "2017-10-17", "date": "2017-10-17", "Company": "Union Labor Life Insurance Company", "City": "Washington", "State": "District Of Columbia", "Type of breach": "HACK", "Type of organization": "BSF", "Total Records": 0, "Description of incident": "\"What Happened:An unauthorized external user was able to briefly access the Outlook email account of an employee of The Union Labor Life Insurance Company (the “Company”) on June 22, 2017. The unauthorized user sent a  spam email from the employee's email account to the employee's various personal and business contacts via email which appeared to be a legitimate email from the employee. The body of each email included either a Dropbox or two PDF documents that have links to malicious websites. A forensic review of the PDF documents performed by the Company’s Information Technology team determinedthat the PDF itself was not malicious, but it  did contain links to sites known to be. The Company’s Information Technology department was notified of the issue within an hour and immediately disabled the account and reset the password, which stopped the flow of spam emails. Within 24-hours of the unauthorized access, the Companyimplemented its Data Incident Response Plan that includes company officers, legal and compliance personnel, IT staff and an external data forensics firm.What Information Was Involved: A forensic review of the emails in the email account's inbox and archived folders identified emails and attachments that may have contained non-public personal information of individuals. A closer review of those emails and attachments revealed that your personal information, specifically your name,SSN and personal health information, including claim numbers, dates of service, diagnosis codes and claim payments were accessible in an attachment, and may have been viewed by the unauthorized user. Your information was not included in the spam e-mail sent from the e-mail account. We have no information indicating that your personal information was in fact accessed by the unauthorized user during the limited time the e-mailaccount was accessible or that you are likely to encounter future identity security problems.\"", "Information Source": "California Attorney General", "Source URL": "https://oag.ca.gov/ecrime/databreach/reports/sb24-103061", "Year of Breach": 2017, "Latitude": 47.751074, "Longitude": -120.740139}