{"Date Made Public": "2018-01-05", "date": "2018-01-05", "Company": "Flagship", "City": "Menlo Park", "State": "California", "Type of breach": "PHYS", "Type of organization": "BSF", "Total Records": 0, "Description of incident": " On or about December 5, 2017, Flagship determined that a company-owned HP Elite Laptop (“Laptop”) was missing from 190 Jefferson, Menlo Park, California 94025. The Laptop was kept in a secure facility and was password protected although the password was shared internally by up to ten employees. The Laptop was approximately four years old and was being used internally to operate B5000 software to process I-9 forms and to record information about individuals who were applying for employment with Flagship in the United States. The Laptop contained.pdf images of U.S. Passports presented with I-9 Forms.What Can You Do? Flagship is offering you one year of identity protection at no cost to you through Experian, one of the three nationwide credit bureaus. The identity protection product, called IdentityWorks Credit Plus, provides identity restoration services, fraud detection tools, and other benefits which includes monitoring your credit file. Starting today, if you suspect that your personal information has been used fraudulently, you can call Experian’s identity restoration agents to assist you to investigate and resolve any incidents of fraud. You may take advantage of this benefit, at any time, until 04/30/2018, by calling the following toll-free number: 1-877-890-9332. No enrollment or activation is necessary. The terms and conditions for identity restoration are located at: www.ExperianIDWorks.com/restoration.While identity restoration is immediately available to you, we also encourage you to activate the fraud detection tools available through Experian IdentityWorks™ as a complimentary one-year membership. This product provides you with superior identity detection and resolution of identity theft. To start monitoring your identity, please follow the steps below:• Ensure that you enroll by 04/30/2018. Your code will not work after this date.• Visit the Experian IdentityWorks website to enroll: https://www.experianidworks.com/3bplus• Provide your activation code: W4DGYMRVP• The deadline for enrollment is 04/30/2018", "Information Source": "California Attorney General", "Source URL": "https://oag.ca.gov/system/files/FlagShip%20Data%20Breach%20Notification%20Letter%20January%202018_0.pdf", "Year of Breach": 2017, "Latitude": 37.45296, "Longitude": -122.181725}